{"records":[{"id":"rec03VxJk18wIwAKd","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Turbinate Reduction","Category":"Nasal Surgery","Description":"Turbinate reduction is a surgical procedure designed to improve nasal airflow in individuals suffering from chronic nasal obstruction. The turbinates are small, bony structures within the nose responsible for warming, humidifying, and filtering inhaled air. When these structures become enlarged or swollen (a condition known as turbinate hypertrophy), often due to allergies, irritants, or chronic inflammation, they can obstruct the nasal passages and lead to significant breathing difficulties, including contributing to obstructive sleep apnea (OSA).\n\nThe primary goal of turbinate reduction is to decrease the size of the turbinate tissue, thereby opening up the nasal airway. This is not a procedure aimed at cosmetic alteration but is a functional surgery to improve breathing. The surgery is typically performed by an Ear, Nose, and Throat (ENT) specialist, also known as an otolaryngologist. It is often considered when more conservative treatments, such as nasal sprays, antihistamines, and other medications, have failed to provide adequate relief.\n\nSeveral surgical techniques can be employed to reduce the size of the turbinates. These methods vary in invasiveness and include cauterization, where a heated probe is used to shrink the tissue; radiofrequency or laser ablation, which uses targeted energy to create scar tissue and reduce tissue volume; and submucosal resection, where a small incision is made and excess tissue is removed from within the turbinate while preserving the outer mucosal lining. In some cases, a partial resection (turbinectomy) of the turbinate bone and tissue may be performed. The choice of technique depends on the patient's specific anatomy and the surgeon's preference.","Cost Range Low":800,"Cost Range High":10000,"Surgeon Fee Range":"$1,000 - $3,000","Facility Fee Range":"$500 - $5,000","Anesthesia Fee Range":"$500 - $2,000","Recovery Time":"1-6 weeks","Hospital Stay":"Outpatient","Success Rate":"Up to 82% for improving nasal obstruction; limited success for resolving sleep apnea (AHI<20 + 50% reduction) based on clinical studies.","AHI Reduction":"4.08 mean reduction","Cure Rate":"Not a curative procedure for sleep apnea (AHI<5); significant AHI reduction is uncommon.","Complication Rate":"Low, with common complications being bleeding, infection, and nasal dryness.","Common Complications":"Bleeding, infection, nasal dryness, crusting, empty nose syndrome (rare), scar tissue, septal perforation, loss of sensation in the nose","BMI Requirements":"Not a primary criterion for this procedure.","Candidacy Criteria":"Patients with chronic nasal obstruction due to enlarged turbinates that has not responded to medical therapy. It may also be recommended for sleep apnea patients who have difficulty with CPAP due to nasal obstruction.","Insurance Coverage":"Generally covered by insurance when deemed medically necessary for chronic nasal obstruction that has failed conservative treatment. Pre-authorization is typically required. Coverage for sleep apnea as the sole indication may be denied by some insurers.","CPT Codes":"30130, 30140, 30801, 30802, 30930","Who Performs":"ENT, Otolaryngologist","Long-term Durability":"Long-term outcomes are generally good for improving nasal breathing. However, in some cases, turbinate tissue can regrow over time, potentially requiring a repeat procedure. A 2022 systematic review noted follow-up periods of up to 12 months in the included studies.","Key Studies":"Schoustra, E., et al. (2022). The Role of Isolated Nasal Surgery in Obstructive Sleep Apnea Therapy—A Systematic Review. Brain Sciences, 12(11), 1446. This review found that isolated nasal surgery does not significantly improve the AHI in the majority of studies, but does improve subjective sleepiness.","Sources":"https://my.clevelandclinic.org/health/treatments/22805-turbinate-reduction, https://www.healthline.com/health/turbinate-reduction, https://pmc.ncbi.nlm.nih.gov/articles/PMC9688553/, https://stanfordhealthcare.org/medical-treatments/n/nasal-surgery/types/turbinate-reduction.html, https://www.pennmedicine.org/treatments/turbinate-reduction, https://www.socalsinus.com/does-insurance-cover-turbinate-reduction-surgery/"}},{"id":"rec5uxX9iAegeBxiX","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"LAUP (Laser-Assisted Uvulopalatoplasty)","Category":"Soft Palate Surgery","Description":"Laser-Assisted Uvulopalatoplasty (LAUP) is a surgical procedure for the treatment of snoring and, in some cases, mild to moderate obstructive sleep apnea (OSA). The procedure involves the use of a carbon dioxide (CO2) laser to remove and reshape the uvula and adjacent soft palate tissue. This is intended to enlarge the airway at the back of the throat, reducing the tissue vibration that causes snoring and the obstruction that contributes to sleep apnea.\n\nLAUP is typically performed as an outpatient procedure under local anesthesia. The surgeon makes a series of vertical incisions in the soft palate on either side of the uvula, and then shortens and reshapes the uvula with the laser. The procedure is often done in several stages, with sessions spaced several weeks apart, to allow for gradual tissue removal and healing. Unlike more invasive procedures like Uvulopalatopharyngoplasty (UPPP), LAUP does not involve the removal of the tonsils or other pharyngeal structures.","Cost Range Low":2000,"Cost Range High":3000,"Surgeon Fee Range":"Not specified, often bundled","Facility Fee Range":"Not specified, often bundled","Anesthesia Fee Range":"Not specified, often bundled","Recovery Time":"1-2 weeks","Hospital Stay":"Outpatient","Success Rate":"23% (AHI<20 + 50% reduction)","AHI Reduction":"32% reduction","Cure Rate":"8% (AHI<5 post-surgery)","Complication Rate":"26% with common complications listed","Common Complications":"Globus sensation, Dryness, Velopharyngeal insufficiency, Bleeding, Velopharyngeal stenosis, Surgical site infection","BMI Requirements":"Not specified, likely for patients with a lower BMI.","Candidacy Criteria":"LAUP is typically indicated for patients with mild to moderate obstructive sleep apnea who have a long, thick soft palate and an enlarged uvula. It is often considered for patients who have failed or are intolerant of CPAP therapy. It is not recommended for severe OSA.","Insurance Coverage":"LAUP is generally considered investigational for the treatment of obstructive sleep apnea by most insurance providers, including Medicare and Blue Cross Blue Shield. As a result, it is often not a covered service. For the treatment of snoring alone, it is considered a cosmetic procedure and is not medically necessary, and therefore not covered. Patients should verify coverage with their specific insurance plan.","CPT Codes":"42299, S2080","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term data on the effectiveness of LAUP is limited and shows mixed results. The effects of the surgery can diminish over time, and some studies have shown a worsening of sleep apnea in the long term due to scarring and narrowing of the airway. The Camacho et al. (2017) meta-analysis concluded that given the unfavorable results, LAUP should be performed with caution or not at all.","Key Studies":"Camacho, M., et al. (2017). Laser-assisted uvulopalatoplasty for obstructive sleep apnea: a systematic review and meta-analysis. Sleep, 40(3).\n\nWischhusen, J., et al. (2019). Laser-assisted uvulopalatoplasty (LAUP) complications and side effects: a systematic review. Nature and Science of Sleep, 11, 59–67.","Sources":"https://www.bcbst.com/mpmanual/!ssl!/webhelp/Laser_Assisted_Uvulopalatoplasty_LAUP.htm, https://newyorkent.com/ent-treatments/sleep-disorders-treatments/laser-assisted-uvulopalatoplasty-laup/, https://pubmed.ncbi.nlm.nih.gov/28201808/, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://pmc.ncbi.nlm.nih.gov/articles/PMC6549768/, https://en.wikipedia.org/wiki/Uvulopalatoplasty, https://www.aapc.com/codes/hcpcs-codes/S2080, https://downloads.cms.gov/medicare-coverage-database/lcd_attachments/19078_13/CodingGuidelinesTreatmentofObstructiveSleepApneaB2002.13R3.pdf"}},{"id":"rec7YvtMAUdCp7YnV","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"UPPP (Uvulopalatopharyngoplasty)","Category":"Soft Palate Surgery","Description":"Uvulopalatopharyngoplasty (UPPP) is a surgical procedure performed to treat obstructive sleep apnea (OSA). The surgery involves the removal and/or reshaping of tissue in the back of the throat to widen the airway. This typically includes the removal of the uvula, part of the soft palate, and the tonsils and adenoids if they are present and enlarged.\n\nThe primary goal of UPPP is to reduce the collapsibility of the airway during sleep, thereby decreasing the number of apneic and hypopneic events. The procedure is performed under general anesthesia and can be done as a standalone procedure or in combination with other sleep apnea surgeries. The specific amount of tissue removed and the reshaping techniques used can vary depending on the individual patient's anatomy and the surgeon's assessment.","Cost Range Low":2000,"Cost Range High":10000,"Surgeon Fee Range":"$800 - $4,000","Facility Fee Range":"$800 - $4,000","Anesthesia Fee Range":"$1,200 - $2,000","Recovery Time":"2-3 weeks","Hospital Stay":"Outpatient or 1 night","Success Rate":"51% (AHI<20 + 50% reduction)","AHI Reduction":"42% reduction","Cure Rate":"24% (AHI<5 post-surgery)","Complication Rate":"1.5% for serious nonfatal complications, 0.2% 30-day mortality rate","Common Complications":"Pain, bleeding, infection, nasopharyngeal stenosis, velopharyngeal insufficiency, changes in voice","BMI Requirements":"BMI < 30 is generally preferred for better outcomes.","Candidacy Criteria":"UPPP is generally recommended for patients with obstructive sleep apnea who have failed conservative treatments like CPAP. Ideal candidates are those with a collapse of the airway at the level of the soft palate. A staging system based on tonsil size, soft palate position, and BMI is used to determine candidacy, with Stage 1 patients having the highest likelihood of success.","Insurance Coverage":"Insurance coverage for UPPP varies by plan and provider. It is often considered a medically necessary procedure for the treatment of moderate to severe OSA when conservative treatments like CPAP have failed. Prior authorization is typically required, and insurance companies may have specific criteria that must be met, such as a certain AHI on a sleep study and documentation of CPAP intolerance. Out-of-pocket costs can still be significant depending on the patient's deductible and coinsurance.","CPT Codes":"42145","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term studies on the effectiveness of UPPP have shown mixed results. While many patients experience initial improvement in their sleep apnea symptoms, the benefits may diminish over time. A 20-year follow-up study showed that almost 50% of patients were not satisfied with the results of the operation, and one-third were using CPAP at follow-up. Another study found that the effect on AHI decreased over time. Modified UPPP techniques have shown more promising long-term results in selected patients.","Key Studies":"Fairbanks, D. N. (1990). Uvulopalatopharyngoplasty complications and avoidance strategies. Otolaryngology–Head and Neck Surgery, 102(3), 239-245. (Reported on complication rates and types); Kezirian, E. J., et al. (2004). Incidence of serious complications after uvulopalatopharyngoplasty. The Laryngoscope, 114(3), 450-453. (Provided data on serious complication and mortality rates); Khan, A., et al. (2009). Uvulopalatopharyngoplasty in the Management of Obstructive Sleep Apnea: The Mayo Clinic Experience. Mayo Clinic Proceedings, 84(9), 795–800. (Provided data on success and cure rates).","Sources":"https://my.clevelandclinic.org/health/treatments/25059-uvulopalatopharyngoplasty-uppp, https://www.goodrx.com/conditions/sleep-apnea/surgery-cost, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://pmc.ncbi.nlm.nih.gov/articles/PMC2735429/, https://pubmed.ncbi.nlm.nih.gov/2108411/, https://www.entnet.org/resource/cpt-for-ent-bundling-issue-uvulopalatopharyngoplasty-and-tonsillectomy-2/"}},{"id":"rec93CTC1VDddEo8U","createdTime":"2026-01-10T17:18:53.000Z","fields":{"Procedure Name":"Lingual Tonsillectomy","Category":"Tongue Base Procedure","Description":"Lingual tonsillectomy is a surgical procedure that involves the removal of lymphoid tissue, known as lingual tonsils, from the base of the tongue. These tonsils, when enlarged (a condition called lingual tonsil hypertrophy), can obstruct the upper airway and are a contributing factor to obstructive sleep apnea (OSA). The surgery is performed in an operating room with the patient under general anesthesia. Surgeons access the lingual tonsils through the mouth, so no external incisions are necessary. The primary goal of a lingual tonsillectomy is to create more space in the airway behind the tongue, thereby reducing or eliminating the obstruction that causes sleep apnea. Various surgical techniques can be employed to remove the tonsil tissue, including radiofrequency ablation, coblation, and microdebrider-assisted resection.","Cost Range Low":0,"Cost Range High":0,"Recovery Time":"2-3 weeks","Hospital Stay":"1-2 nights","Success Rate":"82.8% (defined as postoperative AHI < 5) [1]","AHI Reduction":"49% reduction (from mean 7.88 to 4.02 AHI) [1]","Cure Rate":"51-82.8% (defined as postoperative AHI < 5) [1, 2]","Complication Rate":"14.9% [1]","Common Complications":"Bleeding, dysphagia (difficulty swallowing), fever, nausea, vomiting, diarrhea, acute pain, airway obstruction, infection, tongue numbness or tingling, tongue weakness, tooth injury","BMI Requirements":"No strict BMI cutoff, but a BMI z-score > 2 is associated with surgical failure [1]. A BMI >= 40 kg/m2 increases the risk of same-day admission after outpatient tonsillectomy.","Candidacy Criteria":"Lingual tonsillectomy is generally indicated for patients with moderate to severe obstructive sleep apnea who have evidence of lingual tonsil hypertrophy. It is often considered as a secondary procedure after an adenotonsillectomy has failed to resolve the sleep apnea, or for patients who are unable to tolerate or adhere to CPAP therapy. A thorough evaluation, often including drug-induced sleep endoscopy (DISE), is performed to identify the specific sites of airway obstruction and determine if lingual tonsillectomy is the appropriate intervention.","Insurance Coverage":"Lingual tonsillectomy is typically covered by insurance when it is deemed medically necessary for the treatment of obstructive sleep apnea. Pre-authorization is often required, and the insurance provider will review the patient's medical history, sleep study results, and the surgeon's documentation to confirm that the procedure is warranted. Common reasons for denial may include insufficient evidence of medical necessity or if the procedure is considered experimental or investigational by the insurer.","CPT Codes":"42870","Who Performs":"ENT, Oral Surgeon","Key Studies":"Williamson A, et al. (2024). Safety and efficacy of lingual tonsillectomy in multilevel airway surgery for pediatric obstructive sleep apnea. *J Clin Sleep Med*. [1]\nKang KT, et al. (2017). Lingual Tonsillectomy for Treatment of Pediatric Obstructive Sleep Apnea: A Meta-analysis. *JAMA Otolaryngol Head Neck Surg*. [2]\nMerna C, et al. (2019). Clinical Characteristics, Complications, and Reasons for Readmission following Lingual Tonsillectomy. *Otolaryngol Head Neck Surg*. [3]","Sources":"https://jcsm.aasm.org/doi/10.5664/jcsm.10816, https://pmc.ncbi.nlm.nih.gov/articles/PMC5824231/, https://pubmed.ncbi.nlm.nih.gov/30776976/, https://stanfordhealthcare.org/medical-treatments/t/tongue-surgery/types/lingual-tonsillectomy.html, https://sleep-doctor.com/surgical-treatment-overview/tongue-region-procedures/lingual-tonsillectomy/, https://www.entnet.org/resource/cpt-for-ent-lingual-tonsillectomy-cpt-42870-and-adenoidectomy-2/, https://www.uchicagomedicine.org/conditions-services/sleep-surgery/lingual-tonsillectomy, https://my.clevelandclinic.org/health/treatments/15605-tonsillectomy, https://umc.edu/Healthcare/ENT/Patient-Handouts/Adult/Sleep_Surgery/Tongue_Base_Surgery.html, https://pubmed.ncbi.nlm.nih.gov/27345007/, https://www.atsjournals.org/doi/abs/10.1164/ajrccm.2025.211.Abstracts.A4436, https://www.sciencedirect.com/science/article/abs/pii/S0952818021001458"}},{"id":"recF3Vjkrle7ss2er","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Nyxoah Genio Hypoglossal Nerve Stimulator","Category":"Nerve Stimulation","Description":"The Nyxoah Genio is a hypoglossal nerve stimulator designed to treat moderate to severe Obstructive Sleep Apnea (OSA). It is a minimally invasive, battery-free, and leadless implant that works by stimulating the hypoglossal nerve bilaterally. This stimulation causes the tongue to move forward, preventing the airway from collapsing during sleep.\n\nThe system consists of a small implant placed under the chin in a single-incision outpatient procedure. The implant is powered externally by a disposable patch worn under the chin each night. This patch contains a small activation chip that delivers the stimulation. The therapy is controlled by the patient through a smartphone app, allowing for adjustments to the stimulation levels for comfort and effectiveness.\n\nThe Genio system is designed to be a long-term solution for OSA patients who have not found success with traditional treatments like CPAP. Because the implant is battery-free, it does not require replacement surgeries, and the external components can be upgraded as technology advances.","Cost Range Low":30000,"Cost Range High":60000,"Surgeon Fee Range":"$3,000 - $6,000","Facility Fee Range":"$25,000 - $45,000","Anesthesia Fee Range":"$2,000 - $4,000","Recovery Time":"1 week for return to normal, non-strenuous activity","Hospital Stay":"Outpatient","Success Rate":"63-71% with source (DREAM trial)","AHI Reduction":"70% median reduction","Cure Rate":"35% with source (Genio website)","Complication Rate":"9% with common complications listed","Common Complications":"Pain at the incision site, temporary tongue weakness, numbness or tingling in the tongue, infection, device malfunction.","BMI Requirements":"BMI < 32 kg/m2","Candidacy Criteria":"Moderate to severe Obstructive Sleep Apnea (AHI 15-65), CPAP failure or intolerance, no complete concentric collapse of the soft palate.","Insurance Coverage":"The Genio system has received a favorable CMS reimbursement ruling, with a significant increase in reimbursement rates for 2026. The CPT code 64568 has been assigned to a New Technology Ambulatory Payment Classification (APC), which should improve insurance coverage. The new reimbursement rate for hospital outpatient departments is approximately $45,000, and for ambulatory surgery centers, it is $42,373. This is expected to drive broader adoption and make the therapy more accessible to patients with Medicare and other insurance plans.","CPT Codes":"64568","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"As a relatively new technology, long-term (5-10 year) data is still being collected. The battery-free design of the implant is intended to provide a long-lasting solution without the need for replacement surgeries.","Key Studies":"DREAM (Dual-sided hypoglossal neRvE stimulAtion for the treatMent of obstructive sleep apnea) trial - Published in the Journal of Clinical Sleep Medicine, this was the pivotal study for FDA approval. It showed a 63-71% responder rate (conservative) and a 70% median AHI reduction.","Sources":"https://www.geniosleep.com/, https://nyxoah.com/what-genio, https://aasm.org/nyxoah-receives-fda-approval-for-genio-system/, https://sleep-doctor.com/blog/nyxoah-genio-dream-study-results-and-fda-approval/, https://finance.yahoo.com/news/nyxoah-gains-favorable-cms-reimbursement-141400129.html, https://www.accessdata.fda.gov/cdrh_docs/pdf24/P240024C.pdf, https://sleep-doctor.com/wp-content/uploads/Nyxoah-Genio-Patient-Manual.pdf"}},{"id":"recHbyoDJJZU3ga1t","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Distraction Osteogenesis (Mandibular or Maxillary)","Category":"Skeletal/Jaw Surgery","Description":"Distraction osteogenesis is a surgical procedure that involves the gradual lengthening of a bone. In the context of sleep apnea, it is used to enlarge the upper or lower jaw, which in turn enlarges the airway. The procedure can be performed on the mandible (lower jaw) or the maxilla (upper jaw). Mandibular Distraction Osteogenesis (MDO) is often used for patients with a small or recessed lower jaw (micrognathia). Distraction Osteogenesis Maxillary Expansion (DOME) is a newer technique that expands the upper jaw.\n\nThe procedure is a multi-step process that can take a year or more to complete. First, a custom orthodontic expander device is installed. Then, a surgeon performs an osteotomy, which is a surgical cut in the bone. For MDO, the cut is made in the mandible. For DOME, the cut is made in the maxilla. A distraction device is then attached to the bone on either side of the cut. Over a period of several weeks, the patient or their caregiver turns a screw on the device, which gradually separates the two pieces of bone. New bone then grows in the gap, effectively lengthening the jaw. After the desired amount of expansion is achieved, the device is left in place for several months to allow the new bone to consolidate and harden. Finally, the device is removed, and the patient may need braces or Invisalign to align their teeth.","Cost Range Low":25000,"Cost Range High":65000,"Surgeon Fee Range":"$5,000 - $15,000","Facility Fee Range":"$15,000 - $40,000","Anesthesia Fee Range":"$2,000 - $4,000","Recovery Time":"3-4 weeks of avoiding strenuous activity. A soft diet is required for the first week. The total process, including the consolidation phase, can take several months.","Hospital Stay":"5-7 days in the ICU for neonates, shorter for older children and adults.","Success Rate":"100% for adults (AHI < 20 and ≥ 50% reduction)","AHI Reduction":"94.4% reduction in adults","Cure Rate":"82-100% for adults (AHI < 5)","Complication Rate":"0-25% in adults and 0-20% in children","Common Complications":"Local wound infections, transient facial nerve palsy, numbness in the lower lip and chin, anterior open bite, and distractor mechanical failure.","BMI Requirements":"No specific BMI requirement found, but generally for patients who are not morbidly obese.","Candidacy Criteria":"Patients with obstructive sleep apnea secondary to micrognathia (small lower jaw) or Pierre Robin Sequence. Anatomical criteria include a narrow and highly arched upper palate and a narrow nasal floor. It is also an option for patients with little or no tolerance for CPAP treatment.","Insurance Coverage":"Most insurance companies will cover the cost of the procedure if there is adequate documentation of the patient's condition and medical necessity. Prior authorization is typically required. Common denial reasons include lack of medical necessity or considering the procedure experimental.","CPT Codes":"21199, 21145, 21206","Who Performs":"Oral and Maxillofacial Surgeon, Orthodontist","Long-term Durability":"The systematic review by Tsui et al. (2016) had a mean follow-up period of 6 to 37 months. Some studies have shown good long-term stability of the results, but more research with longer follow-up is needed to fully understand the long-term durability.","Key Studies":"Tsui, W. K., et al. (2016). Distraction osteogenesis as a treatment of obstructive sleep apnea syndrome: A systematic review. Medicine, 95(36), e4674.\nRunyan, C. M., et al. (2014). Cost analysis of mandibular distraction versus tracheostomy in neonates with Pierre Robin sequence. Otolaryngology--Head and Neck Surgery, 151(5), 811-818.","Sources":"https://www.uhhospitals.org/services/ear-nose-and-throat-services/conditions-and-treatments/surgical-sleep/bone-surgery-for-obstructive-sleep-apnea/distraction-osteogenesis-maxillary-expansion, https://pmc.ncbi.nlm.nih.gov/articles/PMC5023883/, https://pubmed.ncbi.nlm.nih.gov/25052512/, https://iowaprotocols.medicine.uiowa.edu/protocols/mandibular-distraction-osteogenesis-pierre-robin-and-sleep-apnea, https://www.aetna.com/cpb/medical/data/500_599/0549.html"}},{"id":"recIdlxqI7UWGF7bA","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Functional Rhinoplasty","Category":"Nasal Surgery","Description":"Functional rhinoplasty is a type of nasal surgery aimed at improving the function of the nose, primarily breathing. Unlike cosmetic rhinoplasty, which focuses on changing the appearance of the nose, functional rhinoplasty addresses structural issues within the nasal passages that cause obstruction. These issues can include a deviated septum (the wall between the nostrils is crooked), enlarged turbinates (structures inside the nose that warm and humidify air), nasal valve collapse (weakness in the nostril walls), or other deformities resulting from trauma or congenital conditions.\n\nThe procedure is typically performed by a facial plastic surgeon or an otolaryngologist (ENT). It is often done as an outpatient procedure under general anesthesia and can take between 2 to 4 hours. The surgeon makes incisions, either within the nostrils (closed rhinoplasty) or across the columella (the tissue between the nostrils, in an open rhinoplasty), to access the underlying bone and cartilage. The specific modifications depend on the patient's anatomy and the source of the obstruction. This may involve straightening the septum (septoplasty), reducing the size of the turbinates (turbinate reduction), or using cartilage grafts to support and open the nasal valves.","Cost Range Low":6074,"Cost Range High":13955,"Surgeon Fee Range":"$3,000 - $7,000","Facility Fee Range":"$2,000 - $5,000","Anesthesia Fee Range":"$1,000 - $2,000","Recovery Time":"1-2 weeks","Hospital Stay":"Outpatient","Success Rate":"Success rates vary widely depending on the study and the definition of success. One study showed a 35% AHI reduction overall, and a 57% reduction in patients with a BMI < 30. However, a meta-analysis concluded that the AHI reduction is often not clinicall","AHI Reduction":"35-57% reduction","Cure Rate":"Cure rates (AHI<5) are low. Functional rhinoplasty is not considered a curative procedure for sleep apnea but can improve symptoms and CPAP compliance.","Complication Rate":"4-19% with common complications listed","Common Complications":"Infection, bleeding, persistent nasal obstruction, septal hematoma, scarring, numbness, epistaxis","BMI Requirements":"BMI < 30 is recommended for optimal outcomes.","Candidacy Criteria":"Ideal candidates for functional rhinoplasty for sleep apnea are patients with diagnosed obstructive sleep apnea (OSA) who have a clear, surgically correctable nasal obstruction. This includes individuals with a deviated septum, enlarged turbinates, or nasal valve collapse. Patients who have failed or are intolerant to CPAP therapy are also strong candidates. A BMI of less than 30 is generally preferred, as obesity can be a significant contributing factor to sleep apnea that nasal surgery alone cannot address. Patients should be in good overall health to undergo a surgical procedure.","Insurance Coverage":"Insurance coverage for functional rhinoplasty is more likely than for cosmetic rhinoplasty, but it is not guaranteed. Coverage typically depends on the medical necessity of the procedure. Insurers will often require documentation of a functional problem, such as a deviated septum causing significant nasal obstruction, and may require evidence of failed conservative treatments, such as nasal sprays or CPAP intolerance. Prior authorization is almost always required. Common denial reasons include lack of documented medical necessity or the procedure being deemed 'cosmetic' in nature.","CPT Codes":"30400, 30410, 30420, 30430, 30435, 30450, 30465, 30520, 30140, 30130","Who Performs":"ENT, Facial Plastic Surgeon","Long-term Durability":"The long-term durability of functional rhinoplasty in improving sleep apnea symptoms is not well-established. While the structural correction to the nose is permanent, the impact on sleep apnea can vary over time. Some studies suggest that subjective improvements in breathing and sleep quality are maintained, but objective measures like AHI may not show sustained significant reduction. Revision surgery rates are reported to be between 2.5% and 12.8% in various studies.","Key Studies":"Shuaib, S. W., et al. (2015). Can functional septorhinoplasty independently treat obstructive sleep apnea?. Plastic and reconstructive surgery, 135(6), 1554–1565. This study showed a significant AHI reduction in patients with a BMI < 30.\n\nSchoustra, E., et al. (2022). The Role of Isolated Nasal Surgery in Obstructive Sleep Apnea Therapy-A Systematic Review. Brain sciences, 12(11), 1446. This meta-analysis concluded that isolated nasal surgery does not significantly improve AHI in the majority of studies.\n\nJoshi, R. R., et al. (2019). Complication Rates Following Septoplasty With Inferior Turbinate Reduction. The Ochsner journal, 19(4), 353–357. This study provides data on complication rates for related procedures.","Sources":"https://pubmed.ncbi.nlm.nih.gov/26017591/, https://www.carecredit.com/well-u/health-wellness/reconstructive-rhinoplasty-cost/, https://www.aafprs.org/AAFPRS/Procedures/Rhinoplast/Functional_Rhinoplasty.aspx, https://pubmed.ncbi.nlm.nih.gov/36358372/, https://pmc.ncbi.nlm.nih.gov/articles/PMC6928672/, https://rhinoplastytoronto.ca/blog/about-rhinoplasty/can-functional-rhinoplasty-improve-my-sleep-apnea/"}},{"id":"recJLj8WiSgHhaijA","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Hyoid Suspension","Category":"Tongue Base Procedure","Description":"Hyoid suspension is a surgical procedure for obstructive sleep apnea that aims to stabilize the airway by moving the hyoid bone. The hyoid bone is a U-shaped bone in the neck that has attachments to the tongue and other soft tissues. By securing the hyoid bone, the procedure prevents the collapse of the airway in the tongue region during sleep. There are different techniques for this procedure. One common method involves making a small incision in the neck and using stitches to secure the hyoid bone to the thyroid cartilage (Adam's apple). Another technique, sometimes called the AIRLIFT procedure, involves placing two small screws in the jaw and passing a suture around the hyoid bone, which is then tightened to the screws. The procedure is performed under general anesthesia in an operating room.","Cost Range Low":6400,"Cost Range High":10000,"Surgeon Fee Range":"$3,000 - $5,000","Facility Fee Range":"$2,000 - $3,000","Anesthesia Fee Range":"$1,400 - $2,000","Recovery Time":"1-2 weeks","Hospital Stay":"1 night","Success Rate":"17-78% with source","AHI Reduction":"38-74% reduction","Cure Rate":"Not widely reported","Complication Rate":"12.5-18% with common complications listed","Common Complications":"Bleeding, infection, difficulty swallowing, nerve injury","BMI Requirements":"BMI < 35-36","Candidacy Criteria":"Patients with obstructive sleep apnea who have failed CPAP therapy and have been identified with tongue base collapse via drug-induced sleep endoscopy (DISE).","Insurance Coverage":"Most insurance plans cover the procedure, particularly the AIRLIFT variant. Prior authorization is typically required.","CPT Codes":"21685","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"The surgical changes are designed to be permanent and last for years. The system is removable if necessary.","Key Studies":"Bowden et al. (2005) - Hyoid suspension alone is not an efficacious treatment for hypopharyngeal airway obstruction in most patients with obstructive sleep apnea. Gillespie et al. (2011) - Hyoid myotomy and suspension with a mandibular screw anchor is an effective method with which to address hypopharyngeal collapse in multilevel surgery for OSA. Siesta Medical AIRLIFT Study (2021) - 74% median reduction in AHI.","Sources":"https://sleep-doctor.com/surgical-treatment-overview/tongue-region-procedures/hyoid-suspension/, https://www.uchicagomedicine.org/conditions-services/sleep-surgery/hyoid-suspension, https://www.carepriceguide.com/procedures/21685?stateId=34, https://www.aapc.com/codes/coding-newsletters/my-otolaryngology-coding-alert/get-ready-to-recoup-your-pay-for-hyoid-suspensions-and-gold-weight-placements-article?srsltid=AfmBOoo3ML1NvKfozBG1vAzUPNGdNFDdj9a9WkquAMrRl9bGRzLCBIto, https://pmc.ncbi.nlm.nih.gov/articles/PMC12234598/, https://jamanetwork.com/journals/jamaotolaryngology/fullarticle/649016, https://sleepworldmagazine.com/2021/04/08/siesta-medicals-airlift-hyoid-suspension-study-shows-74-reduction-in-ahi/, https://pubmed.ncbi.nlm.nih.gov/38479218/"}},{"id":"recJrZfPIAyvsd1om","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Lateral Pharyngoplasty","Category":"Soft Palate Surgery","Description":"Lateral pharyngoplasty is a surgical procedure to treat obstructive sleep apnea (OSA). It is performed under general anesthesia and involves the removal and repositioning of tissue in the soft palate and the lateral pharyngeal walls (the sides of the throat). This procedure is often performed in conjunction with a tonsillectomy if the patient still has their tonsils. The primary objective of lateral pharyngoplasty is to enlarge the airway, thereby reducing the likelihood of its collapse during sleep, which is the hallmark of OSA. By widening the pharyngeal airway, the procedure aims to improve breathing and alleviate the symptoms of sleep apnea without adversely affecting normal functions such as speaking and swallowing.\n\nCompared to the more traditional uvulopalatopharyngoplasty (UPPP), lateral pharyngoplasty is a more complex procedure that involves more extensive dissection of the tissues in the throat. However, for certain patients, particularly those with lateral pharyngeal wall collapse, it can offer superior outcomes. The procedure has evolved over time, with newer versions of the technique being developed to improve its effectiveness and reduce side effects. It is considered a significant surgical intervention and is typically reserved for patients who have not found success with less invasive treatments like Continuous Positive Airway Pressure (CPAP) therapy.","Cost Range Low":6400,"Cost Range High":10000,"Surgeon Fee Range":"$2,000 - $3,000","Facility Fee Range":"$3,000 - $5,000","Anesthesia Fee Range":"$1,000 - $2,000","Recovery Time":"2-4 weeks","Hospital Stay":"1-3 nights","Success Rate":"67-92% with source","AHI Reduction":"59-68% reduction","Cure Rate":"Not explicitly found, but success rates are high.","Complication Rate":"2-4% risk of bleeding","Common Complications":"Bleeding, infection, difficulty swallowing, changes in speech, throat dryness, feeling of something stuck in the throat, narrowing at the top of the throat, change in sense of taste or tongue numbness, tooth injury","BMI Requirements":"No specific BMI requirements found, but generally for patients who have failed CPAP therapy.","Candidacy Criteria":"Patients with moderate to severe obstructive sleep apnea who have failed CPAP therapy. Anatomical criteria include narrowing of the throat or webbing of the posterior arch of the palate. Some studies suggest patients with a lower neck circumference have a greater chance of success. Patients with an AHI below 10 events/hr may not be recommended for the procedure.","Insurance Coverage":"Insurance coverage for lateral pharyngoplasty varies depending on the individual's health insurance policy. It is often covered for patients with a diagnosis of moderate to severe obstructive sleep apnea who have failed a trial of CPAP therapy. Prior authorization is typically required, and common denial reasons include lack of medical necessity or if the procedure is considered investigational by the insurer. Out-of-pocket costs will depend on the patient's deductible, copay, and coinsurance.","CPT Codes":"42950","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term data is limited, but some studies suggest that the benefits of lateral pharyngoplasty can be sustained over time. One study on a similar procedure, sphincter pharyngoplasty, showed that 63.9% of patients had improved speech on clinical examination long-term, though 33.1% underwent revision surgery. Another study on overlapping lateral pharyngoplasty suggested it can avoid long-term recurrence.","Key Studies":"Surgical outcomes of overlapping lateral pharyngoplasty with or without coblator tongue base resection for obstructive sleep apnea (2018): This study showed a 66.7% success rate for OLP alone and 70.6% for OLP with tongue base resection, with significant AHI reduction in both groups. \n\nLateral pharyngoplasty vs. traditional uvulopalatopharyngoplasty for patients with OSA: systematic review and meta-analysis (2022): This meta-analysis found that while both UPPP and lateral pharyngoplasty are effective, lateral pharyngoplasty demonstrated improved, though not statistically significant, post-operative outcomes.","Sources":"https://sleep-doctor.com/surgical-treatment-overview/palate-procedures/lateral-pharyngoplasty/, https://pubmed.ncbi.nlm.nih.gov/29564540/, https://link.springer.com/article/10.1007/s11325-021-02520-y, https://my.clevelandclinic.org/health/treatments/21041-pharyngoplasty, https://www.aapc.com/codes/cpt-codes/42950, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://surgicalsleep.org/for-patients/lateral-pharyngoplasty/"}},{"id":"recK5k6xmXsFiw1VN","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Septoplasty","Category":"Nasal Surgery","Description":"Septoplasty is a surgical procedure to correct a deviated septum, the wall of bone and cartilage that divides the two nostrils. A deviated septum can obstruct airflow, leading to breathing difficulties, snoring, and in some cases, contributing to obstructive sleep apnea (OSA). The surgery involves making an incision inside the nose, lifting the mucous membrane, and then trimming, repositioning, or replacing the cartilage and bone to straighten the septum. The procedure is typically performed on an outpatient basis under general or local anesthesia and takes 30 to 90 minutes. It is one of the most common procedures performed by otolaryngologists (ENTs).","Cost Range Low":5000,"Cost Range High":10000,"Recovery Time":"1-2 weeks for initial recovery, with full healing taking several months.","Hospital Stay":"Outpatient","Success Rate":"Over 90% for improving nasal obstruction, but much lower for resolving sleep apnea. One study showed a 56% reduction in OSA severity.","AHI Reduction":"4.08 mean reduction","Cure Rate":"Very low; nasal surgery alone rarely cures sleep apnea.","Complication Rate":"Rare, but includes risks associated with any surgical procedure.","Common Complications":"Infection, excessive bleeding, decreased sense of smell, septal perforation, septal hematoma, numbness of the nose and teeth","BMI Requirements":"Not specified, but often recommended for patients with a deviated septum and nasal obstruction.","Candidacy Criteria":"Patients with a deviated septum causing nasal obstruction and contributing to sleep apnea symptoms, particularly those who have failed or are intolerant to CPAP therapy. It is not recommended as a first-line treatment for OSA.","Insurance Coverage":"Generally covered by PPO insurance and Medicare if deemed medically necessary to correct a functional breathing impairment. Prior authorization is often required. Cosmetic changes are not covered.","CPT Codes":"30520","Who Performs":"Otolaryngologist (ENT)","Long-term Durability":"The structural correction of the septum is permanent. However, the long-term effect on sleep apnea is not well-established, and symptoms may persist or return.","Key Studies":"The Role of Isolated Nasal Surgery in Obstructive Sleep Apnea Therapy—A Systematic Review (2022), Apnea–hypopnea index decreased significantly after nasal surgery for obstructive sleep apnea: A meta-analysis (2017)","Sources":"https://my.clevelandclinic.org/health/treatments/17779-septoplasty, https://www.cvsurgicalgroup.com/how-much-does-septoplasty-cost-and-will-my-insurance-cover-it/, https://pmc.ncbi.nlm.nih.gov/articles/PMC9688553/, https://journals.lww.com/md-journal/fulltext/2017/02030/apnea_hypopnea_index_decreased_significantly_after.54.aspx"}},{"id":"recLAnvYmji1rRJm5","createdTime":"2026-01-10T17:18:53.000Z","fields":{"Procedure Name":"Upper Airway Stimulation (UAS) Therapy","Category":"Nerve Stimulation","Description":"Upper Airway Stimulation (UAS) therapy is a treatment for obstructive sleep apnea (OSA) that involves the surgical implantation of a small neurostimulation device. The system consists of a pulse generator placed under the clavicle, a sensing lead that monitors breathing patterns, and a stimulation lead connected to the hypoglossal nerve, which controls tongue movement. When the device detects that a person is inhaling, it sends a mild electrical pulse to the hypoglossal nerve. This stimulation causes the tongue to move forward, preventing the airway from collapsing and allowing for normal breathing during sleep. The patient can turn the device on and off using a small remote control. The procedure is minimally invasive and serves as an alternative for patients who cannot tolerate or have not found success with Continuous Positive Airway Pressure (CPAP) therapy.","Cost Range Low":30000,"Cost Range High":40000,"Recovery Time":"2-3 weeks","Hospital Stay":"Outpatient","Success Rate":"75% (AHI <20 and >50% reduction) at 5 years (Woodson et al., 2018)","AHI Reduction":"68% reduction (STAR Trial)","Cure Rate":"Not consistently reported, but significant AHI reduction to mild OSA category (AHI < 10) in many patients (STAR Trial)","Complication Rate":"6% with common complications listed","Common Complications":"temporary pain and swelling at the incision sites, transient tongue weakness, and tongue soreness or discomfort with stimulation","BMI Requirements":"BMI < 32 kg/m2","Candidacy Criteria":"Age 22 years or older, moderate to severe obstructive sleep apnea (AHI of 15 to 65 events per hour), intolerance or inability to get consistent benefit from CPAP, BMI of 32 kg/m2 or less (though this may vary), and a drug-induced sleep endoscopy (DISE) to ensure the airway is collapsing in a way that the device can effectively treat (i.e., not complete concentric collapse at the soft palate).","Insurance Coverage":"Covered by most major commercial insurance providers, as well as Medicare and the VA. Prior authorization is typically required.","CPT Codes":"64568, 64582, 64583, 64584, 31575","Who Performs":"ENT (Otolaryngologist)","Long-term Durability":"The 5-year follow-up to the STAR trial demonstrated that the improvements in AHI, sleepiness, and quality of life were sustained over the long term. The therapy has shown to be a durable and effective long-term treatment for a select group of patients with moderate to severe OSA.","Key Studies":"Strollo, P. J., et al. (2014). Upper-Airway Stimulation for Obstructive Sleep Apnea. The New England Journal of Medicine, 370(2), 139-149. Woodson, B. T., et al. (2018). Upper Airway Stimulation for Obstructive Sleep Apnea: 5-Year Outcomes. Otolaryngology–Head and Neck Surgery, 159(1), 194-202.","Sources":"https://www.mayoclinic.org/medical-professionals/pulmonary-medicine/news/the-emerging-option-of-upper-airway-stimulation-therapy/mac-20431242, https://www.inspiresleep.com/en-us/, https://www.verywellhealth.com/how-much-do-different-sleep-apnea-treatments-cost-4177858, https://www.nejm.org/doi/full/10.1056/NEJMoa1308659, https://pubmed.ncbi.nlm.nih.gov/29582703/, https://www.uasisolutions.com/hypoglossal-nerve-stimulant"}},{"id":"recOMQyvleZfHguIV","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Genioplasty with Maxillomandibular Advancement (MMA)","Category":"Skeletal/Jaw Surgery","Description":"Genioplasty combined with Maxillomandibular Advancement (MMA) is a surgical procedure for treating obstructive sleep apnea (OSA). MMA involves repositioning the upper and lower jaws forward to enlarge the airway. This also pulls the pharyngeal muscles forward and increases tension in the soft tissues of the pharynx, addressing obstruction from the nasal cavity to the hypopharynx. The addition of a genioplasty, which is a chin advancement, specifically targets the genioglossus muscle, advancing it to further open the airway at the base of the tongue. This combined approach provides a comprehensive surgical solution for sleep apnea by addressing multiple points of potential airway collapse.","Cost Range Low":80000,"Cost Range High":100000,"Surgeon Fee Range":"Not specified in the provided research.","Facility Fee Range":"Not specified in the provided research.","Anesthesia Fee Range":"Not specified in the provided research.","Recovery Time":"6 weeks","Hospital Stay":"2-3 nights","Success Rate":"86% (AHI<20 + 50% reduction)","AHI Reduction":"Not specified in the provided research.","Cure Rate":">50% (AHI < 5)","Complication Rate":"Infection: 3.4%, Hematoma: 8.5%, Temporary Numbness: 6.8%","Common Complications":"Infection, hematoma, temporary numbness","BMI Requirements":"Not specified in the provided research.","Candidacy Criteria":"The procedure is indicated for patients with moderate to severe obstructive sleep apnea (OSA). It is not limited to patients with craniofacial dysmorphism and can be effective for those with normal osseous structures and excess soft tissue, including obesity. It can be considered a primary surgical option, not just a 'salvage' procedure after other soft tissue surgeries have failed.","Insurance Coverage":"Not specified in the provided research.","CPT Codes":"Not specified in the provided research.","Who Performs":"Oral and Maxillofacial Surgeon","Long-term Durability":"The final result and condition will occur in nine to 12 months.","Key Studies":"Maxillomandibular advancement surgery: A classic procedure refined - Mayo Clinic; Useful Genioplasty for Repeated Recurrent Sleep Apnea of Congenital Anomalies and Its Evaluation - Kino et al., 2023; Postoperative Complications in Genioplasty and Their Association with Age, Gender, and Type of Genioplasty - Khan et al., 2021","Sources":"https://www.mayoclinic.org/medical-professionals/pulmonary-medicine/news/maxillomandibular-advancement-surgery-a-classic-procedure-refined/mac-20430404, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://pmc.ncbi.nlm.nih.gov/articles/PMC10013626/, https://pmc.ncbi.nlm.nih.gov/articles/PMC8612779/"}},{"id":"recaC0RP6Rb0IDTEl","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Inspire Implant (Hypoglossal Nerve Stimulation)","Category":"Nerve Stimulation","Description":"Inspire therapy is an implantable device designed to treat obstructive sleep apnea (OSA). It works by stimulating the hypoglossal nerve, which controls the movement of the tongue. During sleep, the device delivers gentle pulses to the nerve, causing the tongue to move forward and keep the airway open. The system consists of a small impulse generator implanted under the skin near the collarbone, a breathing sensing lead placed between the ribs, and a stimulation lead placed under the chin. The procedure to implant the device is typically performed on an outpatient basis and takes approximately one to two hours. The physician will make two small incisions, one in the upper chest for the generator and another under the chin for the stimulation lead. The sensing lead is placed with a third small incision in the side of the chest.","Cost Range Low":30000,"Cost Range High":40000,"Surgeon Fee Range":"$600 - $700","Facility Fee Range":"$27,000 - $28,000","Anesthesia Fee Range":"$1,000 - $2,000","Recovery Time":"2-3 weeks","Hospital Stay":"Outpatient","Success Rate":"72-75% with source (Costantino et al., 2020)","AHI Reduction":"68-75% reduction","Cure Rate":"25-30% with source (STAR trial)","Complication Rate":"6% with common complications listed","Common Complications":"Infection, neuropraxia, hematoma/seroma","BMI Requirements":"BMI < 40 or BMI < 35 for Medicare patients","Candidacy Criteria":"Patients must be 18 years of age or older, have a diagnosis of moderate to severe obstructive sleep apnea, be unable to use or get consistent benefit from CPAP, and have a Body Mass Index (BMI) of 40 or less (or <35 for Medicare patients).","Insurance Coverage":"The vast majority of U.S. insurance providers, including Medicare, Veterans Affairs (VA), and major commercial carriers, cover Inspire therapy. Out-of-pocket costs can be as low as $0 for patients with certain insurance plans, such as Tricare or Medicare with a supplement. For patients with commercial insurance like Blue Cross Blue Shield, the out-of-pocket cost can be under $1000 after meeting the deductible.","CPT Codes":"64568, 64582","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"A 5-year study showed a 75% success rate, with a mean reduction in the apnea-hypopnea index (AHI) of 18.0.","Key Studies":"Costantino, A., et al. (2020). Hypoglossal nerve stimulation long-term clinical outcomes: a systematic review and meta-analysis. Sleep & breathing, 24(2), 399-411. Bestourous, D. E., et al. (2020). Adverse events associated with the Inspire implantable hypoglossal nerve stimulator: a MAUDE database review. American journal of otolaryngology, 41(6), 102616.","Sources":"https://www.inspiresleep.com/en-us/the-procedure/, https://www.inspiresleep.com/en-us/cost-and-insurance/, https://sleepbettermaryland.com/the-cost-of-treating-sleep-apnea/, https://pubmed.ncbi.nlm.nih.gov/31418162/, https://pmc.ncbi.nlm.nih.gov/articles/PMC6707009/, https://pubmed.ncbi.nlm.nih.gov/32645535/"}},{"id":"recaWtx01jEpKG5Rm","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Midline Glossectomy","Category":"Tongue Base Procedure","Description":"Midline glossectomy is a surgical procedure performed to reduce the size of the tongue in patients with obstructive sleep apnea (OSA). The procedure is designed to enlarge the airway by removing a portion of the back of the tongue, which can be a significant contributor to airway obstruction during sleep, particularly in individuals who are overweight. The surgery is performed in an operating room under general anesthesia. The surgeon accesses the tongue through the patient's open mouth, avoiding external incisions, with the exception of a small cut on the neck for a temporary drain. Using specialized instruments, a central portion of the tongue muscle is removed. Modern techniques, such as Coblation, utilize radiofrequency energy to minimize damage to surrounding tissues, including nerves and blood vessels, which reduces postoperative pain and complications. After the tissue is removed, the incision is closed with sutures.","Cost Range Low":3940,"Cost Range High":15000,"Surgeon Fee Range":"$1,500 - $5,000","Facility Fee Range":"$2,000 - $8,000","Anesthesia Fee Range":"$500 - $2,000","Recovery Time":"2-3 weeks","Hospital Stay":"1-2 days","Success Rate":"59.6% (AHI < 20 + 50% reduction)","AHI Reduction":"60.4% reduction","Cure Rate":"22.5% (AHI < 5)","Complication Rate":"16.4%","Common Complications":"Bleeding, infection, tongue numbness or tingling, tongue weakness or trouble swallowing, tooth injury","BMI Requirements":"No specific BMI requirement, but obesity is a contributing factor.","Candidacy Criteria":"Patients with obstructive sleep apnea due to an enlarged tongue base who have failed or are intolerant of CPAP therapy. It is often performed as part of a multi-level surgery.","Insurance Coverage":"Most insurance plans, including Aetna and Cigna, may cover midline glossectomy if it is considered medically necessary. Coverage typically requires a diagnosis of moderate to severe OSA, documented failure or intolerance of CPAP therapy, and evidence that tongue base obstruction is a significant contributor to the apnea. Prior authorization is usually required.","CPT Codes":"41120, 41512, 41530, 41599","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term data is limited. One study showed a 75% recovery rate at one year, which decreased to a 14-case recovery at two years. Another study of combined midline glossectomy and UPPP showed a high 6-month cure rate that decreased over time.","Key Studies":"Murphey, A. W., et al. (2015). The Effect of Glossectomy for Obstructive Sleep Apnea: A Systematic Review and Meta-analysis. Otolaryngology–Head and Neck Surgery, 153(3), 334–342.","Sources":"https://sleep-doctor.com/surgical-treatment-overview/tongue-region-procedures/midline-glossectomy/, https://pubmed.ncbi.nlm.nih.gov/26183521/, https://surgerycenterok.com/pricing/partial-glossectomy/, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://www.uhcprovider.com/content/dam/provider/docs/public/policies/comm-medical-drug/obstructive-sleep-apnea-treatment.pdf, https://www.aetna.com/cpb/medical/data/1_99/0004.html, https://static.cigna.com/assets/chcp/pdf/coveragePolicies/medical/mm_0158_coveragepositioncriteria_obstructive_sleep_apnea_diag_trtment_svc.pdf"}},{"id":"recbv1eqbB5LMKIyQ","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"TORS (Transoral Robotic Surgery)","Category":"Tongue Base Procedure","Description":"Transoral Robotic Surgery (TORS) is a minimally invasive surgical procedure for treating obstructive sleep apnea (OSA). It utilizes a robotic surgical system to remove or reduce tissue at the base of the tongue and surrounding areas that obstruct the airway during sleep. The entire procedure is performed through the mouth, which eliminates the need for external incisions.\n\nThe primary objective of TORS for sleep apnea is to create a more open and stable airway at the level of the tongue base, thereby reducing the frequency and severity of apneic events. This can be achieved through several specific procedures, including lingual tonsillectomy (removal of the lingual tonsils), tongue base reduction or debulking (removal of a portion of the tongue muscle), and in some cases, supra-hyoid horizontal epiglottectomy to address obstruction caused by the epiglottis.","Cost Range Low":5832,"Cost Range High":10000,"Surgeon Fee Range":"$1,500 - $4,000","Facility Fee Range":"$2,000 - $5,000","Anesthesia Fee Range":"$300 - $1,000","Recovery Time":"2-4 weeks","Hospital Stay":"2-3 nights","Success Rate":"66.7% with source","AHI Reduction":"59-60% reduction","Cure Rate":"23.8% with source","Complication Rate":"6.9% with common complications listed","Common Complications":"Major bleeding, severe odynophagia with dehydration, oropharyngeal stenosis, transient bleeding, transient dysphagia, dysgeusia","BMI Requirements":"BMI < 35","Candidacy Criteria":"Patients with moderate to severe obstructive sleep apnea who have failed or are intolerant to CPAP therapy are potential candidates for TORS. The primary anatomical consideration is the presence of tongue base obstruction, which is typically identified through a physical examination or a drug-induced sleep endoscopy (DISE). A sufficient mouth opening of at least 25mm is also required to allow for the insertion of the robotic instruments.","Insurance Coverage":"Most insurance plans provide coverage for sleep apnea surgery, including TORS, although the extent of coverage varies by policy. Prior authorization is typically required, and coverage may be contingent on the patient having failed or being intolerant to CPAP therapy.","CPT Codes":"41130","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term data on the durability of TORS for sleep apnea is still emerging. While many studies report on short-term outcomes (typically within the first year), there is limited information on 5- and 10-year outcomes. The available research suggests that TORS is a promising procedure with good short-term results, but more long-term data is needed to fully assess its durability.","Key Studies":"Lechien et al. (2021), Justin et al. (2016), Tsou et al. (2020), Eesa et al. (2015)","Sources":"https://pmc.ncbi.nlm.nih.gov/articles/PMC5683592/, https://pubmed.ncbi.nlm.nih.gov/39136252/, https://pmc.ncbi.nlm.nih.gov/articles/PMC6193426/, https://www.nature.com/articles/s41598-020-75215-1, https://aao-hnsfjournals.onlinelibrary.wiley.com/doi/abs/10.1177/0194599813496044a393, https://my.clevelandclinic.org/health/procedures/transoral-robotic-surgery-tors, https://entsaustin.com/ent-specialists-austin-now-offering-transoral-robotic-surgery-for-obstructive-sleep-apnea/, https://www.healthline.com/health/transoral-robotic-surgery, https://www.pennmedicine.org/treatments/transoral-robotic-surgery-tors, https://pmc.ncbi.nlm.nih.gov/articles/PMC10853828/, https://pmc.ncbi.nlm.nih.gov/articles/PMC12394304/, https://www.sciencedirect.com/science/article/pii/S2049080117301942, https://www.entnet.org/resource/cpt-for-ent-coding-for-implantation-revision-and-removal-of-a-hypoglossal-nerve-stimulator/, https://www.aapc.com/discuss/threads/please-read-op-note-would-cpt-code-42890-be-inclusive-or-can-it-be-billed-separately.147378/, https://www.medstarhealth.org/services/transoral-robotic-surgery-tors, https://med.stanford.edu/ohns/OHNS-healthcare/head-and-neck-surgery/programs/transoral-robotic-surgery.html, https://onlinelibrary.wiley.com/doi/abs/10.1002/hed.26702, https://journals.sagepub.com/doi/abs/10.1177/0194599816630962, https://link.springer.com/article/10.1007/S00405-014-3480-X"}},{"id":"reciT7il5R88AilfB","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"LivaNova Aura6000 Hypoglossal Nerve Stimulator","Category":"Nerve Stimulation","Description":"The LivaNova Aura6000 is an implantable hypoglossal nerve stimulator designed to treat moderate to severe obstructive sleep apnea (OSA). The system consists of an implantable pulse generator (IPG) placed in the chest, connected to an electrode cuff that is wrapped around the hypoglossal nerve in the neck. The device works by delivering cyclical electrical stimulation to the hypoglossal nerve during sleep. This stimulation causes the tongue to move forward, which in turn opens the airway and prevents the collapses that cause sleep apnea.\n\nThe Aura6000 system is unique in that it uses a proximal stimulation approach, meaning the electrode is placed on the main trunk of the hypoglossal nerve before it branches out. This allows for the stimulation of a broader range of tongue muscles, which LivaNova believes provides more flexibility and effectiveness in treating OSA. The stimulation is programmed and customized for each patient to achieve the most favorable tongue movement and airway opening.","Cost Range Low":30000,"Cost Range High":40000,"Surgeon Fee Range":"Not available","Facility Fee Range":"Not available","Anesthesia Fee Range":"Not available","Recovery Time":"Not specified, but the implant procedure is described as a 72-minute outpatient procedure.","Hospital Stay":"Outpatient","Success Rate":"65% (defined as at least a 50% improvement from baseline AHI and an AHI value below 20)","AHI Reduction":"68% reduction","Cure Rate":"Not specified","Complication Rate":"Not specified","Common Complications":"Not specified, but the OSPREY study reported no serious adverse device-related or procedure-related events.","BMI Requirements":"Not specified in the provided materials, but the OSPREY trial included patients with a wide range of BMIs.","Candidacy Criteria":"Patients with moderate to severe obstructive sleep apnea who have failed or are intolerant to PAP therapy. The OSPREY trial for the Aura6000 did not exclude patients with complete concentric collapse (CCC), which is a contraindication for the Inspire device.","Insurance Coverage":"The Aura6000 is currently investigational in the United States and is not yet covered by most insurance plans. However, LivaNova has submitted for premarket approval (PMA) to the FDA. Once approved, it is expected that insurance coverage will be similar to that of other hypoglossal nerve stimulation devices like Inspire. Medicare and many private insurers cover Inspire therapy for eligible patients.","CPT Codes":"64582","Who Performs":"ENT (Otolaryngologist), Oral and Maxillofacial Surgeon","Long-term Durability":"The OSPREY clinical trial has reported 12-month data showing sustained improvement in AHI and ODI. Long-term data beyond 12 months is not yet available.","Key Studies":"OSPREY (NCT04950894), THN3 (NCT02263859)","Sources":"https://investor.livanova.com/news-releases/news-release-details/livanova-announces-12-month-data-osprey-clinical-study-moderate, https://clinicaltrials.gov/study/NCT02263859, https://sleep-doctor.com/blog/livanova-thn-aura6000-stimulation-has-variable-tongue-movements-that-are-associated-with-outcomes/, https://sleepreviewmag.com/sleep-treatments/therapy-devices/emerging-technology/how-pivotal-trial-livanova-osa-neurostimulator-different-ccc/, https://www.goodrx.com/conditions/sleep-apnea/surgery-cost, https://pmc.ncbi.nlm.nih.gov/articles/PMC6707009/, https://www.entnet.org/resource/cpt-for-ent-coding-for-implantation-revision-and-removal-of-a-hypoglossal-nerve-stimulator/"}},{"id":"reclvXQpGl6imnEDP","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"Nasal Valve Repair","Category":"Nasal Surgery","Description":"Nasal valve repair is a surgical procedure designed to correct the narrowing of the nasal valve, which is the narrowest part of the nasal airway. This collapse can obstruct airflow and contribute to symptoms of sleep apnea. The procedure aims to strengthen and support the nasal valve to prevent it from collapsing during inhalation.\n\nThere are several techniques for nasal valve repair. One common method involves cartilage grafting, where cartilage is taken from the nasal septum, ear, or rib and placed to reinforce the nasal sidewalls. Another technique is suture suspension, where sutures are used to suspend the lateral nasal wall to a more stable structure. More recently, bio-absorbable implants have been used to provide support to the nasal valve. The surgery is typically performed through incisions inside the nose, so there is no visible scarring.","Cost Range Low":3000,"Cost Range High":9000,"Surgeon Fee Range":"$600 - $1,800","Facility Fee Range":"$1,800 - $5,400","Anesthesia Fee Range":"$600 - $1,800","Recovery Time":"7-10 days","Hospital Stay":"Outpatient","Success Rate":"Not well-defined for sleep apnea, but one study showed a 54% AHI reduction. It is more successful at improving nasal breathing and CPAP tolerance.","AHI Reduction":"54% reduction","Cure Rate":"Not typically a curative procedure for OSA as a standalone treatment; cure rates (AHI < 5) are low.","Complication Rate":"Complications are rare, but can include bleeding, infection, and changes to the appearance of the nose.","Common Complications":"Temporary swelling, bruising, discomfort, bleeding, infection, septal hematoma, scarring","BMI Requirements":"BMI < 30","Candidacy Criteria":"Patients with nasal obstruction due to nasal valve collapse, particularly those who have failed or are intolerant to CPAP therapy. A BMI of less than 30 is often preferred.","Insurance Coverage":"Insurance coverage for nasal valve repair for sleep apnea can vary. It is more likely to be covered when there is a clear functional impairment of the nasal airway and it is deemed medically necessary. Prior authorization is usually required, and coverage may be denied if it is considered a cosmetic procedure or not the primary treatment for sleep apnea.","CPT Codes":"30465, 30468, 30469","Who Performs":"ENT, Facial Plastic Surgeon","Long-term Durability":"Long-term data is limited, but studies on techniques like temperature-controlled radiofrequency treatment have shown durable symptom relief for nasal airway obstruction.","Key Studies":"Shuaib, S. W., & Stupak, H. D. (2014). Comprehensive Repair of the Nasal Valve in the Management of Obstructive Sleep Apnea. Otolaryngology–Head and Neck Surgery, 151(S1), P139-P139. This study showed a 54% reduction in AHI in a small group of patients.","Sources":"https://www.jeffersonhealth.org/conditions-and-treatments/nasal-valve-repair, https://www.mdsave.com/procedures/nasal-valve-collapse-repair-in-office/d28bfecf, https://aao-hnsfjournals.onlinelibrary.wiley.com/doi/abs/10.1177/0194599814541629a8, https://my.clevelandclinic.org/health/diseases/24977-nasal-valve-collapse, https://www.aapc.com/codes/cpt-codes/30465"}},{"id":"recmkVM4HVXpn5MxM","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Pillar Procedure (Palatal Implants)","Category":"Soft Palate Surgery","Description":"The Pillar Procedure is a minimally invasive surgical treatment for snoring and mild to moderate obstructive sleep apnea (OSA). The procedure involves the insertion of three small, woven implants into the soft palate at the back of the mouth. Each implant is approximately 18 millimeters in length and 1.5 millimeters in diameter.\n\nThe implants add structural support to the soft palate, stiffening it to reduce the tissue vibration that causes snoring. Over time, the body's natural fibrotic response to the implants further increases the rigidity of the soft palate, which helps to prevent it from collapsing and obstructing the airway during sleep. The procedure is performed in a single office visit under local anesthesia and is considered less painful than more invasive surgical options.","Cost Range Low":2000,"Cost Range High":4200,"Surgeon Fee Range":"Not specified in research; included in total cost.","Facility Fee Range":"Not specified in research; included in total cost.","Anesthesia Fee Range":"Not specified in research; included in total cost.","Recovery Time":"1-2 days","Hospital Stay":"Outpatient","Success Rate":"52.2% (long-term surgical response at 26-32 months)","AHI Reduction":"50% reduction","Cure Rate":"Cure rate (AHI<5) not specified in the reviewed clinical studies.","Complication Rate":"Implant extrusion: 7.6% - 73.6%; Pain: 47.5%; Foreign body sensation: 38.7%; Infection: 7.7%; Palatal abscess: 1.1%","Common Complications":"Implant extrusion, pain, foreign body sensation, infection, palatal abscess","BMI Requirements":"BMI < 25 kg/m2 is favorable, with responders to the procedure having a significantly lower preoperative BMI.","Candidacy Criteria":"Ideal candidates are those with mild to moderate obstructive sleep apnea (OSA) where the soft palate is the primary contributor to snoring and apnea. Other factors include age > 18 years, AHI < 30, and favorable oral anatomy (e.g., no severe nasal obstruction, small tonsils).","Insurance Coverage":"Coverage varies by insurance provider. The procedure is more likely to be covered when prescribed for a diagnosis of obstructive sleep apnea, but is often not covered for snoring alone. Some insurance plans consider the Pillar Procedure investigational and do not cover it. It is recommended to check with your insurance provider for specific coverage details.","CPT Codes":"42299 (Unlisted procedure, palate, uvula)","Who Performs":"ENT (Ear, Nose, and Throat) specialists","Long-term Durability":"A long-term study with a mean follow-up of 28.9 months showed a surgical response rate of 52.2%. The mean Apnea-Hypopnea Index (AHI) was reduced from 21.7 to 10.8, and the mean Epworth Sleepiness Scale (ESS) score decreased from 12.3 to 7.9. Snoring was also significantly reduced. However, implant extrusion is a notable long-term complication.","Key Studies":"Khasawneh, L., et al. (2021). Efficacy of pillar implants to reduce snoring and daytime sleepiness. Future Science OA, 7(6), FSO701. (PMC8147739); Neruntarat, C. (2011). Long-term results of palatal implants for obstructive sleep apnea. European Archives of Oto-Rhino-Laryngology, 268(7), 1077–1080. (PubMed: 21298386); Povolotskiy, R., et al. (2020). Complications of Palatal Pillar Implants: An analysis of the MAUDE database and literature review. American Journal of Otolaryngology, 41(1), 102303. (PubMed: 31732316)","Sources":"https://www.clevelandnasalsinus.com/pillar-sleep-apnea-snoring-treatment-cleveland-ohio.html, https://www.mayoclinic.org/pillar-procedure/img-20008978, https://www.healthline.com/health/surgery-for-snoring, https://pmc.ncbi.nlm.nih.gov/articles/PMC8147739/, https://pubmed.ncbi.nlm.nih.gov/21298386/, https://pubmed.ncbi.nlm.nih.gov/31732316/"}},{"id":"recpOOlKJdM78eWe0","createdTime":"2026-01-10T17:18:45.000Z","fields":{"Procedure Name":"MMA (Maxillomandibular Advancement)","Category":"Skeletal/Jaw Surgery","Description":"Maxillomandibular advancement (MMA) is a surgical procedure to treat obstructive sleep apnea (OSA) by repositioning the upper (maxilla) and lower (mandible) jaws forward. This movement of the jawbones enlarges the airway in both the retropalatal and retrolingual regions, which are common sites of airway collapse in individuals with sleep apnea. The procedure involves making cuts in the jawbones (osteotomies) and then using plates and screws to fix them in their new, advanced position. By expanding the skeletal framework, MMA also increases tension on the soft tissues of the pharynx, further preventing airway collapse during sleep.","Cost Range Low":20000,"Cost Range High":100000,"Surgeon Fee Range":"$12,000 - $40,000","Facility Fee Range":"Varies widely depending on the hospital and location.","Anesthesia Fee Range":"$1,000 - $3,000","Recovery Time":"2-6 weeks for initial recovery, with full recovery in 9-12 months","Hospital Stay":"1-3 nights","Success Rate":"86% (AHI < 20 and >50% reduction) [JAMA]","AHI Reduction":"77-85% reduction","Cure Rate":"43-47% (AHI < 5 post-surgery) [JAMA, JCSM]","Complication Rate":"1% major, 3.2% minor, with common complications listed","Common Complications":"Sensory loss in the mental nerve (lower lip and chin), hardware failure, non-union of the maxilla, infection, relapse, and cosmetic changes.","BMI Requirements":"No specific BMI requirements found, but obesity is a factor considered.","Candidacy Criteria":"Adult patients with moderate to severe obstructive sleep apnea who cannot tolerate or have failed CPAP therapy. Other criteria include the presence of structural jawbone abnormalities, excess soft tissue in the mouth, or have had unsuccessful previous soft tissue surgeries.","Insurance Coverage":"MMA surgery for obstructive sleep apnea is often covered by medical insurance, but prior authorization is typically required. Coverage can vary, and patients may still have significant out-of-pocket costs depending on their plan's deductible and coinsurance.","CPT Codes":"21193, 21194, 21195, 21196","Who Performs":"Oral and Maxillofacial Surgeon, ENT","Long-term Durability":"A long-term study by Boyd et al. (2015) with an average follow-up of 6.6 years found that MMA is a clinically effective and safe long-term treatment for most patients with moderate-to-severe OSA, with sustained improvements in AHI, blood pressure, and quality of life.","Key Studies":"Zaghi, S., et al. (2016). Maxillomandibular Advancement for Treatment of Obstructive Sleep Apnea: A Meta-analysis. JAMA Otolaryngology–Head & Neck Surgery. Boyd, S. B., et al. (2015). Long-Term Effectiveness and Safety of Maxillomandibular Advancement for Treatment of Obstructive Sleep Apnea. Journal of Clinical Sleep Medicine.","Sources":"https://www.mayoclinic.org/medical-professionals/pulmonary-medicine/news/maxillomandibular-advancement-surgery-a-classic-procedure-refined/mac-20430404, https://www.pennmedicine.org/treatments/maxillomandibular-advancement, https://jamanetwork.com/journals/jamaotolaryngology/fullarticle/2482990, https://jcsm.aasm.org/doi/10.5664/jcsm.4838, https://pubmed.ncbi.nlm.nih.gov/19861196/, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://www.azjawsurgery.com/patient-information/jaw-surgery-faqs/, https://drbobbryan.com/how-much-jaw-surgery-cost/, https://www.anthem.com/medpolicies/abc/active/gl_pw_d083869.html, https://www.uhhospitals.org/services/ear-nose-and-throat-services/conditions-and-treatments/surgical-sleep/bone-surgery-for-obstructive-sleep-apnea/maxillomandibular-advancement, https://med.stanford.edu/ohns/OHNS-healthcare/sleepsurgery/treatments/skeletal-surgery-postops.html"}},{"id":"recs4FnQ18aH6flAf","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Tongue Base Reduction (Radiofrequency/Coblation)","Category":"Tongue Base Procedure","Description":"Radiofrequency treatment of the tongue is performed to treat snoring and obstructive sleep apnea. There are multiple names that have been used to describe tongue radiofrequency, including radiofrequency ablation (RFA), Somnoplasty, tongue Coblation, or VOAT. The tongue is primarily composed of muscle. During sleep, the muscle can relax, contributing to blockage of breathing in the Tongue Region. Tongue radiofrequency works by using a specially-designed probe to heat the tongue tissues in a controlled fashion and create a certain amount of damage. The repair of that damage includes formation of a scar. This shrinks the tongue slightly, and it also makes it less likely that the tongue falls backward to block breathing during sleep. This procedure can be performed in the operating room, or it can be performed in the outpatient clinic without requiring general anesthesia or sedation. Most patients undergoing tongue radiofrequency should expect a total of 2-3 treatment sessions.","Cost Range Low":3500,"Cost Range High":10000,"Recovery Time":"1-2 weeks","Hospital Stay":"Outpatient or 1 night","Success Rate":"43-70% with source","AHI Reduction":"11.14-22.84 reduction","Complication Rate":"1.95% with common complications listed","Common Complications":"infection, transient swallowing disorder, palatal mucosal breakdown, temporary tongue base neuralgias, uvular sloughing, tongue base abscesses","BMI Requirements":"BMI < 32-40","Candidacy Criteria":"Severe OSA with AHI of 31 events/hour, documented PAP intolerance, and a favorable BMI. Surgical success rates decrease with increasing BMI.","Insurance Coverage":"CPT code 41530 is used for this procedure.","CPT Codes":"41530","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Short-term studies report a 35.5%–66.7% success rate for UPPP combined with CCT, but long-term outcomes remain poorly characterized.","Key Studies":"Coblation Versus Radiofrequency for Tongue Base Reduction in Obstructive Sleep Apnea: A Meta‐analysis (2025)","Sources":"https://sleep-doctor.com/surgical-treatment-overview/tongue-region-procedures/tongue-radiofrequency/, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://pmc.ncbi.nlm.nih.gov/articles/PMC11743998/, https://www.droracle.ai/articles/508221/is-a-tongue-base-reduction-cpt-41530-medically-necessary, https://stanfordhealthcare.org/medical-treatments/t/tongue-surgery/what-to-expect.html"}},{"id":"recsgePiaiJTmueHS","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Genioglossus Advancement","Category":"Tongue Base Procedure","Description":"Genioglossus Advancement is a surgical procedure for the treatment of obstructive sleep apnea (OSA). It is designed to address airway obstruction at the level of the tongue base. The genioglossus is the primary muscle of the tongue, and it attaches to a small bony prominence on the inside of the lower jaw called the genial tubercle. During sleep, the relaxation of this muscle can cause the tongue to fall back and block the airway, leading to apneic events.\n\nThe procedure involves making a small, rectangular-shaped cut in the lower jawbone (a mandibular osteotomy) around the genial tubercle. This segment of bone, along with the attached genioglossus muscle tendon, is then pulled forward by a small, predetermined distance. The bone segment is then fixed in its new, advanced position using a small titanium screw or plate. This advancement tightens the tongue base, making it less likely to collapse and obstruct the airway during sleep. The incision is typically made inside the lower lip, so there are no visible external scars.","Cost Range Low":6000,"Cost Range High":10000,"Recovery Time":"2-3 weeks","Hospital Stay":"Outpatient or 1 night","Success Rate":"53% with AHI < 20 and at least 50% reduction (Kuscu et al., 2015)","AHI Reduction":"41.7% reduction (Emanuelli et al., 2023)","Cure Rate":"65.2% long-term clinical success (for GAHM, a combined procedure) (Neruntarat et al., 2003)","Complication Rate":"12.79% (Calvo-Henriquez et al., 2022)","Common Complications":"Bleeding, infection, tooth injury, numbness of the chin and lower lip, change in appearance, swelling, hematoma, paresthesia of the teeth","BMI Requirements":"BMI < 32","Candidacy Criteria":"Patients with moderate to severe obstructive sleep apnea who have failed or are intolerant of CPAP therapy. Anatomical evaluation, often including drug-induced sleep endoscopy (DISE), should demonstrate that tongue base collapse is a significant contributor to the airway obstruction. Patients should not have complete concentric collapse at the velum (soft palate).","Insurance Coverage":"Insurance coverage for Genioglossus Advancement is variable and often requires prior authorization. Coverage is more likely when the procedure is deemed medically necessary, which typically requires documentation of moderate to severe OSA, failure of CPAP therapy, and anatomical evidence of tongue base obstruction. Common denial reasons include the procedure being considered experimental or not medically necessary by the insurer.","CPT Codes":"21199","Who Performs":"ENT, Oral Surgeon","Long-term Durability":"Long-term studies on Genioglossus Advancement, often in combination with other procedures like hyoid myotomy (GAHM), show sustained improvement in AHI and sleepiness for many patients. One study with a mean follow-up of 39.4 months reported a long-term clinical success rate of 65.2%. However, weight gain is a significant risk factor for recurrence of sleep apnea.","Key Studies":"Neruntarat C, et al. (2003). Genioglossus advancement and hyoid myotomy: short-term and long-term results. The Journal of Laryngology & Otology.\nKuscu O, et al. (2015). Sole effect of genioglossus advancement on apnea hypopnea index of patients with obstructive sleep apnea. Acta Oto-Laryngologica.\nEmanuelli E, et al. (2023). Genioglossus Advancement: Technique Modification for Virtual Surgical Planning and Custom Hardware. The Laryngoscope.","Sources":"https://stanfordhealthcare.org/medical-treatments/t/tongue-surgery/types/genioglossus-advancement.html, https://pubmed.ncbi.nlm.nih.gov/12818058/, https://www.goodrx.com/conditions/sleep-apnea/sleep-apnea-surgery, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://www.aapc.com/blog/2026-get-paid-for-genioglossus-advancement/, https://www.anthem.com/medpolicies/abc/active/mp_pw_a050503.html, https://pmc.ncbi.nlm.nih.gov/articles/PMC9995103/, https://pubmed.ncbi.nlm.nih.gov/25813696/, https://pubmed.ncbi.nlm.nih.gov/36404101/"}},{"id":"reczvxgGe4orw1ugV","createdTime":"2026-01-10T17:18:39.000Z","fields":{"Procedure Name":"Expansion Sphincter Pharyngoplasty (ESP)","Category":"Soft Palate Surgery","Description":"Expansion Sphincter Pharyngoplasty (ESP) is a surgical procedure designed to treat obstructive sleep apnea (OSA) by addressing the collapse of the lateral pharyngeal walls (the sides of the throat). The procedure involves repositioning the palatopharyngeus muscles, which are located on each side of the throat. During the surgery, these muscles are detached from their lower connection point and reattached in a more forward and outward position. This creates greater tension and stability in the soft palate and lateral pharyngeal walls, effectively widening the airway and preventing its collapse during sleep.\n\nESP is often performed in conjunction with a tonsillectomy if the patient still has their tonsils. It is considered a more advanced alternative to traditional Uvulopalatopharyngoplasty (UPPP) because it focuses on repositioning tissues rather than simply removing them, which can lead to better functional outcomes and a lower risk of certain side effects. The goal is to improve airflow and reduce the number of apneic and hypopneic events, thereby alleviating the symptoms of sleep apnea.","Cost Range Low":6000,"Cost Range High":10000,"Surgeon Fee Range":"$2,000 - $3,000","Facility Fee Range":"$3,000 - $5,000","Anesthesia Fee Range":"$1,000 - $2,000","Recovery Time":"2-3 weeks","Hospital Stay":"1-2 nights","Success Rate":"67% (Hong et al., 2019)","AHI Reduction":"51.3% reduction (Hong et al., 2019)","Cure Rate":"80% (AHI < 5) in a pediatric study (Ulualp et al., 2014)","Complication Rate":"2-4% risk of bleeding","Common Complications":"Bleeding, infection, difficulty swallowing, speech changes, throat dryness, sensation of something stuck in the throat, narrowing at the top of the throat, changes in taste or tongue numbness, tooth injury","BMI Requirements":"BMI < 32","Candidacy Criteria":"Patients with moderate to severe obstructive sleep apnea (AHI > 15) who have failed or are intolerant to CPAP therapy. Anatomical findings should include significant lateral pharyngeal wall collapse, which can be identified through drug-induced sleep endoscopy (DISE).","Insurance Coverage":"Insurance coverage for ESP varies by plan and provider. It is often considered a second-line treatment after CPAP failure. Prior authorization is typically required, and coverage may depend on the severity of sleep apnea and the specific criteria of the insurance policy. Out-of-pocket costs can be significant even with insurance.","CPT Codes":"42145, 42950","Who Performs":"ENT (Otolaryngologist)","Long-term Durability":"Long-term studies on ESP are still emerging, but existing data suggests that the procedure can provide lasting improvement in sleep apnea symptoms for many patients. Some studies have shown sustained reductions in AHI and improvements in sleep quality at 3- and 5-year follow-ups. However, as with any sleep apnea surgery, the results can vary, and some patients may experience a recurrence of symptoms over time.","Key Studies":"Hong, S. N., et al. (2019). Indications for and Outcomes of Expansion Sphincter Pharyngoplasty to Treat Lateral Pharyngeal Collapse in Patients With Obstructive Sleep Apnea. JAMA Otolaryngology–Head & Neck Surgery. Ulualp, S. O. (2014). Modified expansion sphincter pharyngoplasty for treatment of children with obstructive sleep apnea. JAMA Otolaryngology–Head & Neck Surgery.","Sources":"https://sleep-doctor.com/surgical-treatment-overview/palate-procedures/expansion-sphincter-pharyngoplasty/, https://pubmed.ncbi.nlm.nih.gov/30844019/, https://www.carecredit.com/well-u/health-wellness/sleep-apnea-surgery-costs-and-financing/, https://www.aapc.com/discuss/threads/expansion-sphincter-pharyngoplasty.135538/, https://www.entnet.org/resource/cpt-for-ent-bundling-issue-uvulopalatopharyngoplasty-and-tonsillectomy-2/, https://pubmed.ncbi.nlm.nih.gov/25077988/, https://scoallentown.com/for-patients/cash-pricing-program/"}}]}