{
  "meta": {
    "version": "1.0",
    "generated": "2026-01-10",
    "total_providers": 45
  },
  "medical_centers": [
    {
      "id": "center-001",
      "name": "Stanford Sleep Surgery Center",
      "slug": "stanford-sleep-surgery-center",
      "type": "academic_medical_center",
      "city": "Redwood City",
      "state": "California",
      "address": "450 Broadway, Pavilion B, 2nd Floor, Redwood City, CA 94063",
      "phone": "(650) 723-6601",
      "website": "https://stanfordhealthcare.org/medical-clinics/sleep-surgery-program.html",
      "specializations": "Sleep Surgery, Obstructive Sleep Apnea",
      "key_surgeons": "Pedro Martins Gomes de Oliveira, MD (Oral and maxillofacial surgeon), Robson Capasso, MD (Head and neck surgeon), Abraham G. Hsieh, MD (Head and neck surgeon)",
      "procedures_offered": "Distraction Osteogenesis Maxillary Expansion, Drug-Induced Sleep Endoscopy, Nasal Surgery, Palate Surgery, Skeletal Surgery, Tongue Surgery, Upper Airway Stimulation",
      "inspire_certified": true,
      "center_of_excellence": "Ranked one of the top ENT hospitals in the nation by U.S. News & World Report.",
      "research_programs": "Active research program to continue developing better ways to diagnose and treat sleep disorders. Pioneering clinical trials that give eligible patients access to promising therapies available only at Stanford Health Care.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance",
      "notes": "The Sleep Surgery Program is part of Stanford Health Care Ear, Nose, and Throat (ENT). They have been performing surgery for sleep disorders for over 35 years.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-002",
      "name": "The Penn Sleep Centers",
      "slug": "the-penn-sleep-centers",
      "type": "academic_medical_center",
      "city": "Philadelphia",
      "state": "Pennsylvania",
      "address": "3624 Market Street, Suite 201, Philadelphia, PA 19104",
      "phone": "(215) 662-7772",
      "website": "https://www.med.upenn.edu/sleepctr/",
      "specializations": "Sleep and circadian research, personalized medicine",
      "key_surgeons": "Raj Dedhia, MD; Julianna Rodin, MD",
      "procedures_offered": "Nasal reconstruction, soft tissue surgery, hypoglossal nerve stimulation, skeletal procedures",
      "inspire_certified": true,
      "center_of_excellence": "The center's mission is to develop and support programs of excellence in sleep and circadian research and education.",
      "research_programs": "Actively recruiting for studies on cryolysis for OSA (ARCTIC-3, ICE-OSA) and phenotyping obstruction patterns with DISE (DISE-PhOP). Past studies include research on hypoglossal nerve stimulation and its effects on cardiovascular health.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance plans are accepted, including Aetna, AmeriHealth, Blue Cross & Blue Shield, Cigna, Humana, Independence Blue Cross, Keystone Health Plan East, Medicare, and UnitedHealthcare. A comprehensive list is available on their website.",
      "notes": "Patient reviews are mixed, with some patients praising the knowledgeable staff and others expressing frustration with the administrative aspects of the center.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-003",
      "name": "Cleveland Clinic Sleep Disorders Center",
      "slug": "cleveland-clinic-sleep-disorders-center",
      "type": "academic_medical_center",
      "city": "Cleveland",
      "state": "Ohio",
      "address": "8800 Euclid Avenue, Cleveland, OH 44106",
      "phone": "(216) 636-5860",
      "website": "https://my.clevelandclinic.org/departments/neurological/depts/sleep-disorders",
      "specializations": "Sleep apnea, Snoring, Insomnia, Restless legs syndrome, Narcolepsy, Parasomnias, Circadian rhythm disorders",
      "key_surgeons": "Alan Kominsky, MD (Head, Section of Surgical Sleep and Snoring), Loutfi Aboussouan, MD (Pulmonary, Critical Care & Sleep Medicine), Harneet Walia, MD (Sleep Medicine), Reena Mehra, MD, MS (Sleep Medicine)",
      "procedures_offered": "Inspire upper airway stimulation, Uvulopalatopharyngoplasty (UPPP), Tonsillectomy, Nasal surgery, Palatal z-plasty, Tongue reduction surgery, Maxillomandibular advancement, Genioglossus advancement",
      "inspire_certified": true,
      "center_of_excellence": "Accredited by the American Academy of Sleep Medicine",
      "research_programs": "The center's research focuses on the intersection of sleep disorders with heart disease, neurodegeneration, seizure disorders, and pulmonary disease. They are also investigating novel neuromodulation therapies for sleep disorders and have a large clinical trials program for hypersomnia.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance",
      "notes": "The center is known for its multidisciplinary approach, with specialists from various fields. They also offer a free mobile app for sleep assessment called 'SLEEP by Cleveland Clinic™'.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-004",
      "name": "Mayo Clinic Sleep Surgery - Rochester, Minnesota",
      "slug": "mayo-clinic-sleep-surgery---rochester-minnesota",
      "type": "academic_medical_center",
      "city": "Rochester",
      "state": "Minnesota",
      "address": "200 First St. SW, Rochester, MN 55905",
      "phone": "(507) 284-2511",
      "website": "https://www.mayoclinic.org/departments-centers/sleep-surgery-clinic/overview/ovc-20469499",
      "specializations": "Sleep apnea surgery, soft tissue surgery, upper airway stimulation, orthognathic surgery",
      "key_surgeons": "Stephen F. Bansberg, M.D., Semirra L. Bayan, M.D.",
      "procedures_offered": "Soft tissue surgery, tonsillectomy, uvulopalatopharyngoplasty (UPPP), Upper airway stimulation therapy (Inspire device), Orthognathic surgery, maxillomandibular advancement (MMA) surgery",
      "inspire_certified": true,
      "center_of_excellence": "Accredited by the American Academy of Sleep Medicine",
      "research_programs": "Active in obstructive sleep apnea research to develop new solutions that improve treatment.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance",
      "notes": "The Sleep Surgery Clinic at Mayo Clinic's campus in Minnesota provides specialized treatment for adults and children with obstructive sleep apnea who haven't found relief with other treatment options, such as continuous positive airway pressure (CPAP).",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-005",
      "name": "Mount Sinai Sleep Surgery Program",
      "slug": "mount-sinai-sleep-surgery-program",
      "type": "academic_medical_center",
      "city": "New York",
      "state": "New York",
      "address": "5 East 98th Street, 8th Floor, New York, NY 10029",
      "phone": "(212) 241-9410",
      "website": "https://www.mountsinai.org/care/ent/services/sleep-surgery",
      "specializations": "Obstructive sleep apnea (OSA), sleep-disordered breathing, Inspire Therapy implant device, robotic surgery",
      "key_surgeons": "Fred Lin, MD, Head and Neck Surgery; Gregory P Tsai, MD, Head and Neck Surgery, Sleep Medicine",
      "procedures_offered": "Uvulopalatopharyngoplasty (UPPP), Uvulopalatal flap, Expansion sphincteroplasty, Palatal Advancement, Tonsillectomy for obstructive sleep apnea, Nasal surgery for sleep apnea, Septoplasty, Turbinate reduction, Nasal valve collapse, Jaw (maxillomandibular) expansion or advancement, Inspire Therapy implant, Robotic surgery, Tongue advancement or ablation surgery",
      "inspire_certified": true,
      "center_of_excellence": "Information not readily available on the website.",
      "research_programs": "Mount Sinai is involved in research for the Inspire Therapy implant, the use of Gabapentin for post-operative pain control, and robotic surgery for sleep apnea. They also take a multidisciplinary approach to care and research, partnering with other divisions like Rhinology.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance",
      "notes": "The program emphasizes a multidisciplinary approach, collaborating with experts in Pulmonary and Sleep Medicine, Oral and Maxillofacial Surgery, Neurology, and Bariatric Surgery. They also use the SNORE-25 quality of life measure to track patient outcomes.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-006",
      "name": "UCLA Sleep Disorders Center",
      "slug": "ucla-sleep-disorders-center",
      "type": "academic_medical_center",
      "city": "Los Angeles",
      "state": "California",
      "address": "10833 Le Conte Ave. Center for Health Sciences [CHS], Suite BE-216, Los Angeles, CA 90095",
      "phone": "(310) 267-5337",
      "website": "https://www.uclahealth.org/medical-services/sleep-medicine",
      "specializations": "Surgical evaluation and treatment of obstructive sleep apnea and snoring, Drug-induced sleep endoscopy, Personalized medicine approach, Advanced palate surgery techniques, Inspire Upper Airway Stimulation®",
      "key_surgeons": "Ravi S. Aysola, MD, Director, UCLA Sleep Disorders Center; Eric J. Kezirian, MD, MPH, Otolaryngology",
      "procedures_offered": "Drug-induced sleep endoscopy, Expansion sphincter pharyngoplasty, Lateral pharyngoplasty, Australian modified palatopharyngoplasty, Inspire Upper Airway Stimulation®",
      "inspire_certified": true,
      "center_of_excellence": "Recognized by colleagues around the world as leaders in the surgical evaluation and treatment of obstructive sleep apnea and snoring; Continuous accreditation by the American Academy of Sleep Medicine.",
      "research_programs": "Actively involved in basic and clinical research aimed at determining the conditions that result in sleep disturbances and identifying successful treatments. Currently conducting research funded by the National Institutes of Health examining the physical causes of obstructive sleep apnea and also other potential causes that may be treatable with medications.",
      "patient_volume": "High, major referral center for especially-challenging cases.",
      "insurance_accepted": "Most major insurance, including Medicare and most HMO and PPO plans.",
      "notes": "The center has been established for over 50 years and has the largest group of clinical sleep researchers in the United States. They use a personalized medicine approach, and Dr. Kezirian developed the VOTE Classification scoring system for drug-induced sleep endoscopy.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-007",
      "name": "Massachusetts Eye and Ear",
      "slug": "massachusetts-eye-and-ear",
      "type": "academic_medical_center",
      "city": "Boston",
      "state": "Massachusetts",
      "address": "243 Charles Street, Boston, MA 02114",
      "phone": "(617) 573-3954",
      "website": "https://masseyeandear.org/specialties/sleep-medicine",
      "specializations": "Sleep medicine, Otolaryngology-Head and Neck Surgery",
      "key_surgeons": "Noah S. Siegel, MD; Phillip A. Huyett, MD; John M. Dobrowski, MD, FACS; Phoebe K. Yu, MD, MPH; Roxanne C. Bavarian, DMD, DMSc; Karen Lee, MD; Donald G. Keamy, Jr., MD, MPH; Gillian R. Diercks, MD, MPH; Christopher J. Hartnick, MD, MS; Nicolas Y. BuSaba, MD, FACS",
      "procedures_offered": "Hypoglossal nerve stimulation (Inspire), CPAP, BiPAP, and other surgical and non-surgical treatments for sleep apnea and snoring.",
      "inspire_certified": true,
      "center_of_excellence": "Recognized by Inspire Medical Systems in 2021 as a 'Physician of Excellence' program.",
      "research_programs": "Active clinical trials, including a multi-centered trial for the use of the hypoglossal nerve stimulator in children with Down syndrome and severe OSA. Research focus on sleep disorders and their treatments.",
      "patient_volume": "High. Over 300 hypoglossal nerve stimulator implantations since 2019.",
      "insurance_accepted": "Most major insurance",
      "notes": "The program has four physicians board-certified in both otolaryngology-head and neck surgery and sleep medicine, more than any other sleep program in the US. They offer specialized sleep services at 10 locations throughout Eastern Massachusetts.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-008",
      "name": "Vanderbilt Sleep Surgery Program",
      "slug": "vanderbilt-sleep-surgery-program",
      "type": "academic_medical_center",
      "city": "Nashville",
      "state": "Tennessee",
      "address": "719 Thompson Lane, Suite 30400, Nashville, TN 37204",
      "phone": "(615) 322-6180",
      "website": "https://www.vanderbilthealth.com/program/sleep-surgery",
      "specializations": "Sleep Apnea, Snoring, Hypoglossal nerve stimulation (Inspire therapy)",
      "key_surgeons": "David T. Kent, MD (Director of Sleep Surgery, Director of Translational Research, Associate Professor), Holly Budnick, APRN",
      "procedures_offered": "Hypoglossal nerve stimulation (Inspire therapy), Bilevel Positive Airway Pressure (BIPAP), In-office snoring and sleep apnea treatments, Lifestyle changes, Nasal airway surgery, Oral (dental) appliances, Positional therapy",
      "inspire_certified": false,
      "center_of_excellence": "Designated as an Excellence Program Care Team by Inspire Medical Systems.",
      "research_programs": "Active research in the neurophysiology of the upper airway, including a $4 million NIH-funded study on ansa cervicalis stimulation (ACS) led by Dr. David T. Kent. The program also offers access to other clinical trials.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance, including Aetna, BlueCross BlueShield, Cigna, Humana, and Medicare.",
      "notes": "First program in Tennessee to offer hypoglossal nerve stimulation (Inspire therapy).",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-009",
      "name": "The Johns Hopkins Center for Snoring and Sleep Apnea Surgery",
      "slug": "the-johns-hopkins-center-for-snoring-and-sleep-apnea-surgery",
      "type": "academic_medical_center",
      "city": "Baltimore",
      "state": "Maryland",
      "address": "601 N. Caroline St., Baltimore, MD 21287",
      "phone": "(443) 997-6467",
      "website": "https://www.hopkinsmedicine.org/otolaryngology/specialty-areas/snoring-sleep-surgery",
      "specializations": "Obstructive sleep apnea, snoring, hypoglossal nerve stimulation therapy",
      "key_surgeons": "Kevin M. Motz, MD (Director, Division of Sleep Surgery); James H. Clark, MBBChBAO; David W. Eisele, MD; Matthew Lewis Kashima, MD; Luu Van Pham, MD; Robin Yang, MD DDS",
      "procedures_offered": "Nasal Surgery (Septoplasty, Nasal turbinate reduction, Nasal valve reconstruction), Palatal Surgery (Expansion Pharyngoplasty, Uvulopalatopharyngoplasty (UPPP), Tonsillectomy, Palate radiofrequency, Palatal implantation), Base of Tongue Surgery (Lingual tonsillectomy, Partial midline glossectomy, Radiofrequency to the base of tongue, Genioglossus advancement, Hyoid myotomy and suspension, Tongue suspension suture), Dental Sleep Medicine (Maxillomandibular advancement, Custom oral appliances), Hypoglossal nerve stimulation (Inspire)",
      "inspire_certified": true,
      "center_of_excellence": "Not explicitly mentioned, but Johns Hopkins is a leading academic medical center.",
      "research_programs": "Active research programs in sleep medicine with researchers from diverse backgrounds in endocrinology, neurology, psychiatry, and pulmonary medicine.",
      "patient_volume": "High, as a major academic medical center.",
      "insurance_accepted": "Aetna, CareFirst BlueCross BlueShield, Cigna Healthcare, First Health, Geisinger Health Plan, Johns Hopkins Health Plans, Kaiser. Patients are advised to confirm with their insurance provider.",
      "notes": "The center offers a multidisciplinary team and personalized treatment plans, including both surgical and non-surgical options. They also have a pediatric sleep care program.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-010",
      "name": "Northwestern Medicine Sleep Surgery Clinic",
      "slug": "northwestern-medicine-sleep-surgery-clinic",
      "type": "academic_medical_center",
      "city": "Chicago",
      "state": "Illinois",
      "address": "676 N Saint Clair St, Suite 1325, Chicago, IL 60611",
      "phone": "(312) 695-8182",
      "website": "https://www.nm.org/conditions-and-care-areas/ent-ear-nose-throat/sleep-surgery-clinic",
      "specializations": "Sleep Surgery, Obstructive Sleep Apnea, Snoring",
      "key_surgeons": "Reena Dhanda-Patil, MD (Otolaryngology)",
      "procedures_offered": "Sleep Endoscopy, Hypoglossal Nerve Stimulation, Nasal Interventions, Palate Surgery, Skeletal Surgery, Tongue Surgery, Upper Airway Stimulation",
      "inspire_certified": true,
      "center_of_excellence": "Northwestern Memorial Hospital is nationally ranked in 11 adult specialties by U.S. News & World Report.",
      "research_programs": "The Division of Sleep Medicine at Northwestern University Feinberg School of Medicine conducts clinical trials on sleep disorders. The Sleep Surgery division has a research program focused on understanding obstructive sleep apnea and developing new treatments.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance",
      "notes": "The Northwestern Medicine Sleep Surgery division was the first of its kind to be established in Illinois. They offer a multidisciplinary approach, working closely with the Northwestern Medicine Sleep Health Centers.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-011",
      "name": "UCSF Sleep Surgery Center",
      "slug": "ucsf-sleep-surgery-center",
      "type": "academic_medical_center",
      "city": "San Francisco",
      "state": "California",
      "address": "2380 Sutter Street, San Francisco, CA 94115",
      "phone": "(415) 353-2757",
      "website": "https://ohns.ucsf.edu/sleepsurgery",
      "specializations": "Surgical treatment of sleep-related breathing disorders, obstructive sleep apnea, snoring, innovative surgical techniques, and clinical research.",
      "key_surgeons": "Jolie Chang, MD; Megan Durr, MD; Andrew Goldberg, MD, MS",
      "procedures_offered": "Uvulopalatopharyngoplasty (UPPP), Expansion Sphincter Pharyngoplasty (ESP), Tonsillectomy, Lingual Tonsillectomy, Transoral Robotic Surgery (TORS), Epiglottoplasty, Hyoid Suspension, Hypoglossal Nerve Stimulation (Inspire), Maxillomandibular Advancement (MMA), Drug-Induced Sleep Endoscopy (DISE), and various in-office procedures for snoring and nasal obstruction.",
      "inspire_certified": true,
      "center_of_excellence": "UCSF is a leading academic medical center and is consistently ranked among the top hospitals in the nation. While not explicitly designated as a 'Center of Excellence' for sleep surgery, its reputation, research, and the expertise of its surgeons indicate a high level of care.",
      "research_programs": "The UCSF Sleep Surgery division's research focuses on several key areas, including improving decision-making for sleep surgery, understanding and addressing barriers to care for obstructive sleep apnea (OSA), utilizing digital health and sleep tracking devices to measure treatment outcomes, investigating the physiological changes in laryngeal and pharyngeal sensation in OSA, and studying surgical outcomes and contributing to international consensus statements on OSA.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance plans are accepted. It is recommended to verify coverage with the center directly.",
      "notes": "UCSF has multiple locations. The Sleep Surgery Center is located at the Sutter Street address. The main UCSF Medical Center is at a different location. For sleep surgery inquiries, it is best to use the contact information for the Sleep Surgery division.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-012",
      "name": "NYU Langone Health - Division of General Otolaryngology & Sleep Surgery",
      "slug": "nyu-langone-health---division-of-general-otolaryngology-&-sleep-surgery",
      "type": "academic_medical_center",
      "city": "New York",
      "state": "New York",
      "address": "550 First Avenue, New York, NY 10016",
      "phone": "(646) 929-7870",
      "website": "https://med.nyu.edu/departments-institutes/otolaryngology-head-neck-surgery/divisions-centers/general-otolaryngology-sleep-surgery",
      "specializations": "Sleep Surgery, General Otolaryngology, Pediatric Otolaryngology, Sleep Medicine",
      "key_surgeons": "Erich P. Voigt, MD (Director, Division of General Otolaryngology and Sleep Surgery), Courtney Chou, MD, Nikhita Jain, MD, Alcibiades J. Rodriguez, MD, Mandana Mahmoudi, MD, PhD, MPH, Rodolfo Miranda, MD, Kammi Grayson, DO, Ari Klapholz, MD",
      "procedures_offered": "Uvulopalatopharyngoplasty (UPPP), Laser-assisted uvulopalatoplasty, Cautery-assisted uvulopalatoplasty, Palatal implants (Pillar® procedure), Tongue surgery, Nasal surgery (septoplasty, turbinate reduction), Maxillomandibular advancement, Robotic surgery for obstructive sleep apnea, Inspire upper airway stimulation, Tonsillectomy and adenoidectomy",
      "inspire_certified": true,
      "center_of_excellence": "NYU Langone Health is consistently ranked among the top hospitals in the nation by U.S. News & World Report, though a specific designation for sleep surgery was not found.",
      "research_programs": "Research focuses on the etiology and pathogenesis of chronic tonsillar hypertrophy and standardizing clinical hearing tests. Dr. Voigt is involved in clinical research on Thyroid and Parathyroid outcomes and Intracapsular Tonsillectomy.",
      "patient_volume": "High, as indicated by the large number of sleep medicine specialists and the breadth of procedures offered.",
      "insurance_accepted": "Most major insurance plans are accepted. Patients are advised to verify with the hospital.",
      "notes": "The program is highly integrated with other specialties, including pulmonology, neurology, and dentistry, to provide comprehensive care. They offer both office-based and inpatient surgical options.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-013",
      "name": "Duke Sleep Disorders Center",
      "slug": "duke-sleep-disorders-center",
      "type": "academic_medical_center",
      "city": "Durham",
      "state": "North Carolina",
      "address": "400 Elf St, Durham, NC 27705",
      "phone": "(919) 684-2057",
      "website": "https://www.dukehealth.org/locations/duke-sleep-disorders-center",
      "specializations": "Comprehensive sleep disorder treatment, advanced surgical options, first fellowship-trained sleep surgeon in North Carolina (Dr. Emily Commesso)",
      "key_surgeons": "Emily Commesso, MD; Russell Kahmke, MD; Matthew Ellison, MD",
      "procedures_offered": "Nasal surgeries (septoplasty, turbinate reduction), Palatal surgeries (tonsillectomy, uvulopalatopharyngoplasty), Tongue procedures (hypoglossal nerve stimulation/Inspire therapy, radiofrequency ablation), Epiglottis procedures, Drug-induced sleep endoscopy",
      "inspire_certified": true,
      "center_of_excellence": "Yes, accredited by the American Academy of Sleep Medicine. Duke University Hospital is nationally ranked by U.S. News & World Report.",
      "research_programs": "Current clinical trials are pending IRB approval. The center focuses on a comprehensive, multidisciplinary approach to sleep medicine.",
      "patient_volume": "High",
      "insurance_accepted": "Aetna, Ambetter, Blue Cross Blue Shield of NC, Cigna, Duke Employee Plans, Experience Health, Humana, Medicare, NC Medicaid, TRICARE, United Healthcare",
      "notes": "The center is an accredited sleep laboratory on the campus of Duke University Hospital, offering sleep testing for adults and children. Overnight studies require a caregiver for children. Private rooms with amenities are provided. Insurance verification before appointments is recommended.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-014",
      "name": "Emory Sleep Center",
      "slug": "emory-sleep-center",
      "type": "academic_medical_center",
      "city": "Atlanta",
      "state": "Georgia",
      "address": "12 Executive Park Drive Northeast, Atlanta, GA 30329",
      "phone": "(404) 712-7533",
      "website": "https://www.emoryhealthcare.org/services/sleep-center",
      "specializations": "Sleep Medicine, Pulmonology, Neurology, Epilepsy Neurology",
      "key_surgeons": "Donald L Bliwise, PhD; Toral Shah, DO; Meredith Greer, MD; Surina Sharma, MD; David B Rye, MD; Avery Howard Nathanson, MD; David A Schulman, MD, MPH; Kendall James Nichols, MD; Romy Hoque, MD; Lynn Marie Trotti, MD, MSc",
      "procedures_offered": "Jaw surgery, Mouth, throat and windpipe surgeries (tonsillectomy, uvulopalatopharyngoplasty), Nasal surgeries, Nerve stimulation (Upper airway stimulation), Tongue surgeries, Weight loss surgery",
      "inspire_certified": true,
      "center_of_excellence": "Yes, accredited by the American Academy of Sleep Medicine (AASM)",
      "research_programs": "The Emory Sleep Center is involved in a variety of research, including clinical trials. Some of the research areas include the MACS/WIHS Combined Cohort Study, Flumazenil for the Treatment of Primary Hypersomnia, and Clarithromycin for the Treatment of Hypersomnia. They also have a Sleep Medicine Fellowship program.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance plans, including private and employer-based plans, Federal health insurance marketplace plans, Medicare, Medicare Advantage, and Kaiser Permanente.",
      "notes": "The Emory Sleep Center is a leading facility for the diagnosis and treatment of sleep disorders. They offer a comprehensive approach to sleep medicine, with a team of board-certified sleep specialists, nurse practitioners, and sleep technologists. They are also actively involved in research and education.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-015",
      "name": "Houston Methodist Sleep Center at Texas Medical Center",
      "slug": "houston-methodist-sleep-center-at-texas-medical-center",
      "type": "academic_medical_center",
      "city": "Houston",
      "state": "Texas",
      "address": "6565 Fannin Street, Main Building, 9th Floor, Houston, TX 77030",
      "phone": "(713) 441-7854",
      "website": "https://www.houstonmethodist.org/pulmonology/locations/texas-medical-center/sleep-center/",
      "specializations": "Sleep Surgery, Otolaryngology-Head and Neck Surgery, multidisciplinary approach to sleep medicine",
      "key_surgeons": "Umair Ashraf, MD (Pulmonology, Sleep Medicine), Leonard Chow, MD (Critical Care Medicine, Pulmonary Critical Care, Pulmonology, Sleep Medicine), Timothy A. Connolly, MD (Critical Care Medicine, Pulmonology, Sleep Medicine), Clinton Doerr, MD (Critical Care Medicine, Pulmonology, Sleep Medicine), Jaya Jacob, NP (Pulmonology, Sleep Medicine), Scott Richard Sherron, MD (Cardiology, Interventional Cardiology, Sleep Medicine), Mohi U. Syed, MD (Pulmonary Critical Care, Pulmonology, Sleep Medicine), J. Georges Youssef, MD (Critical Care Medicine, Pulmonology, Sleep Medicine, Transplant Pulmonology), Faisal Zahiruddin, DO (Pulmonology, Sleep Medicine), Nancy J. Esper, MD (Concierge Medicine, Sleep Medicine)",
      "procedures_offered": "Diagnostic sleep studies, Home sleep studies, \"Inspire\" titration, Multiple sleep latency testing (MSLT), Maintenance of wakefulness testing (MWT), Positive airway pressure (PAP) titration (both continuous and bi-level titrations), Split-night sleep studies, Cephalometric Analysis, Overnight Sleep Study, Breathing Devices (CPAP), Medication, Psychiatric Evaluation, Surgery",
      "inspire_certified": true,
      "center_of_excellence": "Yes, accredited by the American Academy of Sleep Medicine (AASM).",
      "research_programs": "The Division Chief of Sleep Surgery will lead innovative research. The program integrates expertise across neurology, respiratory, and cardiac disciplines to develop personalized treatment plans and combines advanced diagnostic tools with groundbreaking research.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance plans accepted, including Aetna, Blue Cross Blue Shield, Cigna, and United Healthcare. A comprehensive list is available on the website.",
      "notes": "The center is actively seeking a Division Chief of Sleep Surgery to develop a premier Sleep Surgery Center. The Houston Methodist Sleep Center is one of the only sleep centers in Houston accredited by the American Academy of Sleep Medicine (AASM).",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-016",
      "name": "UT Southwestern Medical Center, Department of Otolaryngology-Head and Neck Surgery",
      "slug": "ut-southwestern-medical-center-department-of-otolaryngology-head-and-neck-surgery",
      "type": "academic_medical_center",
      "city": "Dallas",
      "state": "Texas",
      "address": "2001 Inwood Road, 6th and 7th Floor, Dallas, Texas 75390",
      "phone": "(214) 645-8898",
      "website": "https://utswmed.org/locations/wcb3/otolaryngology-clinic/",
      "specializations": "Otolaryngology, Endoscopic Ear Surgery, Implanted stimulators for sleep apnea, nasal airway obstruction, sinus disease, salivary gland disorders, thyroid surgery, facial trauma, sleep apnea surgery with implanted hypoglossal nerve stimulators",
      "key_surgeons": "Hongzhao Ji, M.D.",
      "procedures_offered": "Endoscopic ear surgery, nasal airway obstruction surgery, sinus surgery, salivary gland surgery, thyroid surgery, facial trauma surgery, sleep apnea surgery, hypoglossal nerve stimulation (Inspire)",
      "inspire_certified": true,
      "center_of_excellence": "Accredited by both the American Academy of Sleep Medicine and the Joint Commission.",
      "research_programs": "The department is engaged in almost 100 research projects. The main areas of clinical research are: Pediatric sleep apnea, Skull base tumor bank, Acoustic Neuroma, NF2, Endoscopic ear surgery, Cochlear implants, Paraganglioma, Tumors of head and neck, Tonsillectomy, Voice Disorders.",
      "patient_volume": "High. UT Southwestern faculty and residents provide care to more than 140,000 hospitalized patients and oversee approximately 5.1 million outpatient visits annually.",
      "insurance_accepted": "Most major insurance plans are accepted, including Aetna, Blue Cross Blue Shield, Cigna, Humana, and United Healthcare. It is recommended to verify coverage directly with the clinical practice or hospital.",
      "notes": "The program is described as one of the most advanced sleep and breathing centers in the nation. It is the largest center in North Dallas for narcolepsy patients. The Otolaryngology department has an active research program with almost 100 research projects.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-017",
      "name": "University of Michigan Sleep Disorders Center",
      "slug": "university-of-michigan-sleep-disorders-center",
      "type": "academic_medical_center",
      "city": "Ann Arbor",
      "state": "Michigan",
      "address": "24 Frank Lloyd Wright Dr, Ann Arbor, MI 48105",
      "phone": "(734) 936-9068",
      "website": "https://www.uofmhealth.org/our-care/specialties-services/sleep-disorders-program",
      "specializations": "Multidisciplinary approach with specialists from neurology, otolaryngology, pediatrics, psychiatry, and pulmonary medicine, behavioral sleep medicine program for chronic insomnia, sleep disorders in the context of other neurological conditions",
      "key_surgeons": "Jeffrey John Stanley, MD; Jayson Greenberg MD, FACS, CPC, ELI-MP; Paul T Hoff MD, MS; Mark E P Prince, MD, FRCS(C), FACS",
      "procedures_offered": "Uvulopalatopharyngoplasty (UPPP), Upper airway stimulation therapy, Radiofrequency volumetric tissue reduction (RFVTR), Septoplasty and turbinate reduction, Genioglossus advancement, Hyoid suspension, Midline glossectomy and lingualplasty, Maxillomandibular osteotomy (MMO) and advancement (MMA), Palatal implants, Weight loss surgery, Laser-assisted uvuloplasty (LAUP), Tracheostomy",
      "inspire_certified": true,
      "center_of_excellence": "Yes, nationally recognized by U.S. News & World Report for Pulmonology & Lung Surgery (#14) and Ear, Nose & Throat (#16).",
      "research_programs": "The University of Michigan Sleep Disorders Center has a broad research portfolio spanning basic, translational, and clinical research. Key areas of focus include engineering better sleep, sleep across the lifespan, and the interplay of sleep with other medical and neurological conditions such as multiple sclerosis, stroke, Parkinson's disease, and ADHD. They are also involved in developing new diagnostic and management tools for sleep disorders, including mobile apps and novel CPAP technologies.",
      "patient_volume": "High (approximately 10,000 clinic visits and 10,000 sleep studies annually)",
      "insurance_accepted": "Most major insurance plans are accepted, but it is recommended to confirm with the insurance company prior to scheduling an appointment.",
      "notes": "The University of Michigan Sleep Disorders Center is one of the oldest, largest, and most widely recognized academic sleep programs in the U.S. They have a strong focus on research and a multidisciplinary approach to patient care.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-018",
      "name": "University of Washington Sleep Surgery",
      "slug": "university-of-washington-sleep-surgery",
      "type": "academic_medical_center",
      "city": "Seattle",
      "state": "Washington",
      "address": "1959 NE Pacific Street, 3rd Floor, NE 300, Seattle, WA 98195",
      "phone": "(206) 598-4022",
      "website": "https://otolaryngology.uw.edu/specialties/sleep-surgery/",
      "specializations": "Sleep surgery for snoring and obstructive sleep apnea",
      "key_surgeons": "Juliana Bonilla-Velez, MD; Maya Sardesai, MD, MEd; Nilesh N. Shah, MD; Edward M. Weaver, MD, MPH",
      "procedures_offered": "Nasal Surgery, Airway Surgery, Palate stiffening, Tonsillectomy, Uvulopalatopharyngoplasty (UPPP)",
      "inspire_certified": false,
      "center_of_excellence": "No information found",
      "research_programs": "The sleep medicine group at UW conducts research on sleep health disparities, sleep apnea treatment adherence, the effects of CPAP on brain function and Alzheimer's biomarkers, care pathways for sleep apnea, the pathophysiology of sleep disorders, and the relationship between sleep-disordered breathing and cardiovascular disease.",
      "patient_volume": "No information found",
      "insurance_accepted": "Most major insurance",
      "notes": "The program is part of the UW Department of Otolaryngology-Head and Neck Surgery and has clinics at Harborview Medical Center and Seattle Children's Hospital.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-019",
      "name": "Cedars-Sinai Sleep Center",
      "slug": "cedars-sinai-sleep-center",
      "type": "academic_medical_center",
      "city": "Los Angeles",
      "state": "California",
      "address": "8700 Beverly Blvd., Los Angeles, CA 90048",
      "phone": "(800) 233-2771",
      "website": "https://www.cedars-sinai.org/programs/lung/specialties/sleep-health.html",
      "specializations": "Central sleep apnea (CSA), Circadian rhythm disorders, Hypersomnia, Hypoventilation, Insomnia, Narcolepsy, Obstructive sleep apnea (OSA), Parasomnias, Restless legs syndrome",
      "key_surgeons": "Dennis M. Tang, MD (Otolaryngology); Martin L. Hopp, MD, PhD (Otolaryngology); Ankona Ghosh, MD (Otolaryngology); Babak Larian, MD (Otolaryngology); Abhita T. Reddy, MD (Otolaryngology); Matthew K. Lee, MD (Otolaryngology); Gene C. Liu, MD (Otolaryngology); Gary S. Bellack, MD (Otolaryngology); David M. Alessi, MD (Otolaryngology, Surgical Oncology); Marc Cohen, MD (Otolaryngology); Ali Namazie, MD (Otolaryngology); Kathryn Kreicher, MD (Otolaryngology); Ashley E. Kita, MD (Otolaryngology); Kaitlynne Pak, MD (Otolaryngology); Neal Deot, MD (Otolaryngology); Tania Hassanzadeh, MD (Otolaryngology)",
      "procedures_offered": "CPAP, lifestyle changes, mandibular advancement device, positional therapy, hypoglossal nerve stimulation, surgical interventions to remove airway obstructions or create a wider airway.",
      "inspire_certified": true,
      "center_of_excellence": "Yes, #5 in the U.S. for Pulmonology & Lung Surgery and highly ranked for Ear, Nose & Throat by U.S. News & World Report.",
      "research_programs": "Active research in new treatments, techniques, and technologies for lung diseases. The pulmonary research team at the Women's Guild Lung Institute is comprised of world-class researchers spanning multiple disciplines.",
      "patient_volume": "High",
      "insurance_accepted": "Most major insurance plans",
      "notes": "Offers a multidisciplinary team of experts, including specialists in ear, nose, and throat care, lung conditions, and sleep medicine. Virtual second opinion service is available.",
      "featured": true,
      "verified": true
    },
    {
      "id": "center-020",
      "name": "UPMC Sleep Medicine Center",
      "slug": "upmc-sleep-medicine-center",
      "type": "academic_medical_center",
      "city": "Pittsburgh",
      "state": "Pennsylvania",
      "address": "1400 Locust St., Building A, 4th Floor, Room 4412, Pittsburgh, PA 15219",
      "phone": "(412) 232-7409",
      "website": "https://www.upmc.com/services/pulmonology/our-services/sleep-medicine",
      "specializations": "Sleep apnea, snoring, insomnia, restless leg syndrome, narcolepsy, medical and surgical sleep-disordered breathing, sedated endoscopy, neurostimulation therapy",
      "key_surgeons": "Ryan J. Soose, MD; Mazen El Ali, MD; Ravi Alagar, MD, FCCP, FRCPC; Charles Atwood, MD; Rachel Givelber, MD; Laurie Kilkenny, MD; David Kristo, MD; Sanjay Patel, MD; Andrew Perez, MD; Patrick Strollo, MD; Maria Sunseri, MD, FAASM",
      "procedures_offered": "Hypoglossal nerve stimulator implant (Inspire), Nasal surgery (septoplasty, turbinate reduction), Pharyngeal surgery (tonsillectomy, adenoidectomy, reconstructive procedures), Skeletal surgery (maxillomandibular advancement - MMA), CPAP therapy, cognitive behavioral therapy, medication",
      "inspire_certified": true,
      "center_of_excellence": "The Sleep Center at UPMC Williamsport Divine Providence Campus has earned its fourth consecutive reaccreditation from the American Academy of Sleep Medicine (AASM).",
      "research_programs": "The Sleep Surgery Division is involved in pioneering research for obstructive sleep apnea (OSA), focusing on optimizing patient selection, refining surgical techniques, and tailoring therapy. Dr. Ryan Soose was instrumental in the STAR trial, which led to the FDA approval of the Inspire Hypoglossal Nerve Stimulator System.",
      "patient_volume": "High. The UPMC Mercy Sleep Medicine Center performs approximately 1,300 sleep studies annually, and the UPMC Sleep Medicine Center conducts about 2,000 in-lab adult sleep studies each year.",
      "insurance_accepted": "Most major insurance",
      "notes": "The center is a multidisciplinary program incorporating respiratory medicine, psychiatry, otolaryngology, and bariatric surgery specialists. A physician referral is required for evaluation and treatment.",
      "featured": true,
      "verified": true
    }
  ],
  "independent_clinics": [
    {
      "id": "clinic-001",
      "name": "ENT & Allergy Associates - Madison Avenue",
      "slug": "ent-&-allergy-associates---madison-avenue",
      "type": "independent_practice",
      "lead_surgeon": "Ofer Jacobowitz, MD, PhD, FAASM, FAAOA",
      "city": "New York",
      "state": "NY",
      "address": "18 East 48th Street, 2nd Floor, New York, NY 10017-1014",
      "phone": "(646) 868-4300",
      "website": "https://www.entandallergy.com/find-a-doctor/ofer-jacobowitz-md-phd-faasm-faaoa/",
      "specializations": "Adult Ear, Nose and Throat, Pediatric Ear, Nose and Throat, Sleep Services, Sleep Medicine, Rhinology",
      "procedures_offered": "Custom Oral Appliance fitting, In office advanced snoring treatment, Palatal implants, ablation, contouring, barbed sutures, In office Nasal Procedures, Vivaer nasal airway remodeling, Clarifix, Turbinate reduction, Septoplasty, In office Balloon Sinuplasty for Sinusitis, Drug-Induced Sleep Endoscopy (DISE), Lateral Pharyngoplasty, Barbed Reposition Pharyngoplasty (BRP), and Expansion Sphincter Pharyngoplasty (ESP), preserving the uvula, Nasal reconstructive surgery (nasal valve, septoplasty, turbinate, endoscopic sinus procedures, UPPP, preserving the uvula, Palatal Advancement Pharyngoplasty, Tonsillectomy and Adenoidectomy, Lingual tonsillectomy (Coblation), Midline glossectomy (Coblation), Hyoid suspension, Inspire",
      "inspire_certified": true,
      "notable_achievements": "Chair of the Sleep Disorders Committee of the American Academy of Otolaryngology/Head & Neck Surgery; Secretary of the World Sleep Society; Chair of the International Surgical Sleep Society of Congress in 2019 in New York; Editor in chief of the upcoming edition of textbook, Sleep Apnea and Snoring; The first in New York to perform hypoglossal neurostimulation for sleep apnea and Vivaer, an in-office procedure for nasal obstruction; Castle Connolly’s Top Doctor (2016-2023)",
      "patient_reviews": "4.9 out of 5 stars from 263 ratings and 108 comments.",
      "insurance_accepted": "Aetna (NY), ArchCare (NY), BC/BS Empire NY (NY), BC/BS HealthPlus (NY), Cigna (NY), Elderplan (NY), EmblemHealth GHI (NY), Empire Plan (UHC) (NY), Fidelis (NY), Hamaspik (NY), HealthCare Partners IPA (NY), HealthFirst (NY), HIP (NY), Horizon NJ BCBS (NY), Magnacare (NY), Medicare (NY), Multiplan/PHCS (NY), Northwell Direct (NY), OSCAR (NY), Oxford Freedom (NY), Partners Direct Health (NY), Partners Health Plan (NY), Tricare (NY), UHC Oxf Liberty (NY), UnitedHealthcare (NY), US Family Health (NY), VA Healthcare (NY), WTC Health For Heroes (NY)",
      "unique_services": "First in New York to perform hypoglossal neurostimulation (Inspire) for sleep apnea and Vivaer, an in-office procedure for nasal obstruction. Offers rapid diagnosis via home testing devices like WatchPAT.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-002",
      "name": "Chicago ENT - Advanced Center for Specialty Care",
      "slug": "chicago-ent---advanced-center-for-specialty-care",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Michael Friedman, MD, FACS",
      "city": "Chicago",
      "state": "IL",
      "address": "3000 N. Halsted Street, Suite #400, Chicago, IL 60657",
      "phone": "(773) 296-5500",
      "website": "https://chicagoent.com/",
      "specializations": "Otolaryngology-Head and Neck Surgery, Sleep Surgery, Endoscopic Sinus Surgery, Thyroid and Parathyroid Surgery, Head and Neck Cancer",
      "procedures_offered": "UPPP, Inspire, MMA, Septoplasty, Snoring, Sleep Apnea, Elevoplasty, Insomnia, Restless Legs, CPAP Alternatives, Balloon Sinuplasty, Sinuva, Sinus CT Imaging, Minimally Invasive Endoscopic Sinus Surgery, Nasal Valve Repair, Parathyroid Adenoma/Hyperplasia, Thyroid Tumors, Removal of Cervical Lymph Nodes and Neck Dissection, Nasal and Laryngeal Endoscopy, Cancer of the Mouth and Throat, Laryngeal Cancer, Fine Needle Biopsy, Parotid and Submandibular Gland Tumors, Throat Infection",
      "inspire_certified": true,
      "notable_achievements": "Recipient of 'America's Top Doctor' by Castle-Connolly and 'Chicago Magazine's Top Doctors'. Published over 200 scientific articles and co-authored numerous book chapters and textbooks on sleep apnea, snoring, and thyroid/parathyroid surgery.",
      "patient_reviews": "Patient reviews are generally positive, with a 4.76/5 rating on Zocdoc. Patients praise his knowledge and experience. Some negative reviews mention communication and bedside manner.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "Offers leading-edge treatments, attracting patients from across the US and internationally. The practice provides online tools like a 'Symptom Checker' and 'Sinus Quiz'.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-003",
      "name": "Sleep Apnea Surgery Center",
      "slug": "sleep-apnea-surgery-center",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Kasey K. Li, DDS, MD, FACS",
      "city": "Mountain View",
      "state": "CA",
      "address": "1174 Castro St #112, Mountain View, CA 94040",
      "phone": "(650) 322-8588",
      "website": "https://sleepapneasurgery.com/",
      "specializations": "Otolaryngology, Oral and Maxillofacial Surgery, Facial Plastic and Reconstructive Surgery, Sleep Apnea Surgery",
      "procedures_offered": "Nasal Surgery, Nasomaxillary Expansion, Maxillomandibular Advancement, Orthognathic Surgery",
      "inspire_certified": false,
      "notable_achievements": "Co-founded the multidisciplinary treatment program with Dr. Christian Guilleminault at Stanford Sleep Disorders Clinic in 1998. Published more than 100 scientific articles and book chapters on sleep apnea surgery and maxillofacial surgery. Internationally recognized expert in sleep apnea surgery.",
      "patient_reviews": "The website provides a comprehensive list of patient experiences, categorized by procedure. The reviews are overwhelmingly positive, with patients frequently describing Dr. Li as a life-saver and praising his expertise and compassionate care. Many patients report significant improvement in their sleep apnea symptoms and overall quality of life after surgery.",
      "insurance_accepted": "Accepts all PPO insurance plans, but is an out-of-network provider.",
      "unique_services": "Developed the EASE (Endoscopically-Assisted Surgical Expansion) procedure in 2017 to maximize nasal airway expansion while minimizing side effects.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-004",
      "name": "Froedtert & the Medical College of Wisconsin",
      "slug": "froedtert-&-the-medical-college-of-wisconsin",
      "type": "independent_practice",
      "lead_surgeon": "Dr. B. Tucker Woodson, MD",
      "city": "Milwaukee",
      "state": "WI",
      "address": "8701 Watertown Plank Rd, Milwaukee, WI 53226",
      "phone": "(414) 805-7667",
      "website": "https://www.woodsonsleepmd.com/, https://www.froedtert.com/doctors/b-tucker-woodson-1366494858",
      "specializations": "Otolaryngology, Sleep Medicine, Head and Neck Surgery",
      "procedures_offered": "Inspire Therapy, Non-Invasive Sleep Apnea and Snoring Therapies, Oral Appliance Therapy for Sleep Apnea, Second Opinions, Septoplasty, Snoring Implants, Specialized and Surgical Treatment of Sleep Apnea and Snoring, Turbinate Reduction",
      "inspire_certified": true,
      "notable_achievements": "Nationally and internationally recognized expert in Obstructive Sleep Apnea Syndrome. Director of the Froedtert Hospital/Medical College of Wisconsin Sleep Disorders Program. He has served on multiple committees of the American Academy of Otolaryngology-Head & Neck Surgery and the American Academy of Sleep Medicine.",
      "patient_reviews": "4.8/5 stars based on 107 reviews. Patients praise his expertise, communication, and friendly demeanor.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "Dual board certification in Sleep and Surgery. Works to advance and improve treatment of sleep disorders and sleep apnea.",
      "practice_type": "Hospital-affiliated practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-005",
      "name": "Eric J. Kezirian, MD, MPH",
      "slug": "eric-j-kezirian-md-mph",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Eric J. Kezirian, MD, MPH",
      "city": "Santa Monica",
      "state": "CA",
      "address": "1131 Wilshire Blvd., Suite 302, Santa Monica, CA 90401",
      "phone": "(424) 259-6559",
      "website": "https://sleep-doctor.com/",
      "specializations": "Otolaryngology-Head and Neck Surgery, Sleep Medicine",
      "procedures_offered": "Inspire Upper Airway Stimulation, tongue radiofrequency, expansion sphincter pharyngoplasty",
      "inspire_certified": true,
      "notable_achievements": "Professor in the UCLA Department of Head and Neck Surgery at the David Geffen School of Medicine at UCLA; Past President of the International Surgical Sleep Society.",
      "patient_reviews": "Patient reviews are overwhelmingly positive, praising Dr. Kezirian for his expertise, responsiveness, and caring approach. Many patients report life-changing results and successful treatment of sleep apnea and snoring, often after previous unsuccessful treatments. Patients appreciate his thorough explanations and personalized treatment plans.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "Offers video consultations for patients from long distances and develops tailored treatment plans for each patient.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-006",
      "name": "Asia Sleep Centre",
      "slug": "asia-sleep-centre",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Kenny Pang, MBBS, MRCS (Edinburgh), FRCS (Edinburgh), FRCS (Ireland), Masters of Medicine (ORL)",
      "city": "Singapore",
      "state": "N/A",
      "address": "290 Orchard Road, #18-04 Paragon, Singapore 238859",
      "phone": "(65) 6836 0060",
      "website": "https://asiasleepcentre.com/",
      "specializations": "Sleep Surgery, ENT, Otorhinolaryngology, Sleep Medicine",
      "procedures_offered": "Pang's Expansion Sphincter Pharyngoplasty (PESP), Modified Cautery Assisted Palate Surgery/Anterior Palatoplasty, Tongue Suspension, Nasal Surgery, Palate Surgery, Tongue Surgery, CPAP",
      "inspire_certified": false,
      "notable_achievements": "Inventor of Pang's Expansion Pharyngoplasty and Modified Cautery Assisted Palate Surgery. Published over 60 articles in international peer-reviewed journals and written over 20 chapters in American textbooks. Course director for multiple international sleep surgery courses.",
      "patient_reviews": "Google reviews show a rating of 4.7/5.",
      "insurance_accepted": "Unknown",
      "unique_services": "Pioneered minimally invasive tongue suture surgery in Asia. Offers Mini-Fellowships for ENT/Dental/Respiratory specialists.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-007",
      "name": "Stanford Health Care Sleep Surgery Program",
      "slug": "stanford-health-care-sleep-surgery-program",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Robson Capasso, MD",
      "city": "Redwood City",
      "state": "CA",
      "address": "450 Broadway, Pavilion B Fl 2 MC 5730, Redwood City, CA 94063",
      "phone": "(650) 723-6601",
      "website": "https://stanfordhealthcare.org/medical-clinics/sleep-surgery-program.html",
      "specializations": "Sleep Surgery, Otolaryngology, Head and Neck Surgery",
      "procedures_offered": "Distraction Osteogenesis Maxillary Expansion, Drug-Induced Sleep Endoscopy, Nasal Surgery, Palate Surgery, Skeletal Surgery, Tongue Surgery, Upper Airway Stimulation (Inspire)",
      "inspire_certified": true,
      "notable_achievements": "Professor of Otolaryngology – Head & Neck Surgery at Stanford University, where he leads one of the world's most renowned Sleep Surgery services. He serves as Faculty Advisor to the Stanford Center for Clinical Research (SCCR).",
      "patient_reviews": "Dr. Capasso is often described as courteous and helpful. People appreciate that he listens to their concerns, addresses them thoroughly, and explains things clearly. Many find him to be friendly and value the care he provides. Some also noted his knowledge and preparedness. (4.9/5 based on 45 ratings)",
      "insurance_accepted": "Most major insurances",
      "unique_services": "The program is part of a leading academic and research institution, offering access to clinical trials and a multidisciplinary team approach. They have a \"Circle of Care\" approach, and weekly review meetings with experts from multiple specialties.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-008",
      "name": "Arizona Sinus Center, a division of Valley ENT",
      "slug": "arizona-sinus-center-a-division-of-valley-ent",
      "type": "independent_practice",
      "lead_surgeon": "Ryan Rehl, M.D., F.A.C.S.",
      "city": "Phoenix",
      "state": "AZ",
      "address": "926 E McDowell Rd, Ste 207, Phoenix, AZ 85006",
      "phone": "(602) 258-9859",
      "website": "https://www.azvent.com/",
      "specializations": "Otolaryngology/ENT, Rhinology, Sleep Surgery",
      "procedures_offered": "Endoscopic sinus surgery, Revision endoscopic sinus surgery, Endoscopic CSF leak repair, Endoscopic orbital decompression, Endoscopic nasal and sinus tumor removal, Computerized surgical navigation, Inspire implant surgery for obstructive sleep apnea",
      "inspire_certified": true,
      "notable_achievements": "Founder of the Arizona Sinus Center; Past President of the Arizona Society of Otolaryngology-Head and Neck Surgery; Section Chief of Otolaryngology-Head and Neck Surgery at Banner University Medical Center-Phoenix; Clinical Assistant Professor at the University of Arizona College of Medicine-Phoenix; Fellow of the American College of Surgeons; Repeatedly selected for Phoenix Magazine’s Top Doctors list.",
      "patient_reviews": "4.9-star rating (1565 reviews). Patients praise Dr. Rehl's thoroughness, knowledge, and caring demeanor. The staff is described as friendly, helpful, and efficient.",
      "insurance_accepted": "Most major insurances. It is recommended to call to confirm.",
      "unique_services": "Dr. Rehl has subspecialty training in complex nasal and sinus disorders, including advanced endoscopic surgical techniques. The practice emphasizes a holistic approach and patient education.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-009",
      "name": "Osborne Head & Neck Institute",
      "slug": "osborne-head-&-neck-institute",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Ryan F. Osborne, MD, FACS",
      "city": "Los Angeles",
      "state": "CA",
      "address": "8618 S. Sepulveda Blvd, Los Angeles, CA 90045",
      "phone": "(310) 657-0123",
      "website": "https://ohni.org/",
      "specializations": "Otolaryngology-Head and Neck Surgery, Head and Neck Surgical Oncology, Sleep Surgery",
      "procedures_offered": "UPPP, Inspire, Sialendoscopy, Sinus Surgery, Head and Neck Cancer Surgery, Eagle Syndrome Surgery",
      "inspire_certified": true,
      "notable_achievements": "Internationally-renowned expert in head and neck oncology, known for developing ground-breaking surgical procedures. Founder of the Osborne Head and Neck Foundation.",
      "patient_reviews": "4.2-star rating on Healthgrades based on 27 reviews. Patients describe him as a knowledgeable, skilled, compassionate, and down-to-earth surgeon.",
      "insurance_accepted": "Most major insurances. Please verify coverage with the provider.",
      "unique_services": "Offers sialendoscopy, a minimally invasive procedure for the non-surgical removal of salivary gland stones.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-010",
      "name": "Penn Sleep Surgery",
      "slug": "penn-sleep-surgery",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Raj C. Dedhia, MD, MSCR",
      "city": "Philadelphia",
      "state": "PA",
      "address": "301 South 8th St, Philadelphia, PA 19106",
      "phone": "(215) 349-4182",
      "website": "https://www.pennsleepsurgery.org/",
      "specializations": "Sleep Surgery, Otorhinolaryngology, Head and Neck Surgery, Sleep Medicine",
      "procedures_offered": "Nasal reconstruction, soft tissue surgery, hypoglossal nerve stimulation, skeletal procedures, Inspire therapy",
      "inspire_certified": true,
      "notable_achievements": "Director of Sleep Surgery at University of Pennsylvania, one of the first 10 otolaryngologists in the U.S. to complete a fellowship in sleep medicine, Castle Connolly Top Doctor for 5 consecutive years.",
      "patient_reviews": "Dr. Dedhia is described as a true professional who is attentive and easy to communicate with. Patients on RealSelf and Yelp have reported positive experiences and results.",
      "insurance_accepted": "Most major insurances, including Aetna, Cigna, Medicare, and United Healthcare.",
      "unique_services": "Offers treatment for patients with complete concentric collapse (CCC), a group previously considered refractory to neurostimulation.",
      "practice_type": "Academic Medical Center",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-011",
      "name": "ADVENT",
      "slug": "advent",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Madan Kandula, MD, Board-certified in Otolaryngology – Head & Neck Surgery",
      "city": "Milwaukee",
      "state": "WI",
      "address": "10001 W. Innovation Drive, Suite 200, Milwaukee, WI 53226",
      "phone": "(888) 938-3838",
      "website": "https://adventknows.com/",
      "specializations": "ENT, Sinus Surgery, Sleep Surgery",
      "procedures_offered": "Balloon Sinuplasty, In-Office CT Scan, At-Home Sleep Study, Allergy Drops, CPAP, Oral Appliance Therapy, Polypectomy, Uvulectomy, Snoreplasty, Septoplasty, Nasal Valve Repair, Nasal Cryotherapy, Turbinate Reduction",
      "inspire_certified": false,
      "notable_achievements": "Founder of ADVENT, which has grown to over 35 locations in six states. Dr. Kandula was the first surgeon in Wisconsin to perform Balloon Sinuplasty. He is also the pioneer of \"The Breathing Triangle®\" concept for evaluating and treating airway issues. ADVENT has received numerous awards, including being named to the Milwaukee Business Journal's 'Best Places to Work' and 'Fastest Growing Firms' lists.",
      "patient_reviews": "ADVENT has over 5,000 Google reviews with a high average rating. Patients frequently praise the efficiency of the practice, the effectiveness of the treatments, and the caring and professional staff. Some negative reviews on the BBB website mention high costs and unsuccessful treatments.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "ADVENT's approach is centered around \"The Breathing Triangle®,\" a concept developed by Dr. Kandula that focuses on the nose and throat as the starting point for all breathing and sleep issues. The practice emphasizes simple, in-office procedures with minimal downtime.",
      "practice_type": "Private Practice, Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-012",
      "name": "eos Sleep",
      "slug": "eos-sleep",
      "type": "independent_practice",
      "lead_surgeon": "Dr. David O. Volpi, MD, MPH, FACS",
      "city": "New York",
      "state": "NY",
      "address": "993 Park Avenue, Suite 1C, New York, NY 10028",
      "phone": "(212) 873-6036",
      "website": "https://www.eossleep.com",
      "specializations": "Sleep Surgery, ENT, Sinus Surgery, Otolaryngology",
      "procedures_offered": "Palate Coblation, Coblation Turbinate Reduction, Laser Assisted Tonsil Ablation, Balloon Sinuplasty, Pillar Procedure, Laser Assisted Uvulopalatoplasty, Radiofrequency Ablation of the Tongue",
      "inspire_certified": false,
      "notable_achievements": "Founder of eos sleep, a leading center for snoring and sleep apnea treatment. Board-certified otolaryngologist with over 30 years of private practice experience in New York City.",
      "patient_reviews": "Patients generally report positive experiences, highlighting Dr. Volpi's sincerity, intelligence, and surgical skill. Reviews mention successful outcomes for sleep apnea and snoring procedures with no complications.",
      "insurance_accepted": "No, eos Sleep does not accept insurance according to Yelp.",
      "unique_services": "Specializes in minimally invasive procedures for sleep apnea and snoring.",
      "practice_type": "Private Practice, Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-013",
      "name": "LA Sinus and Snoring",
      "slug": "la-sinus-and-snoring",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Marc Kayem, MD, FRCSC",
      "city": "Beverly Hills",
      "state": "CA",
      "address": "120 S Spalding Dr. #300, Beverly Hills, CA 90212",
      "phone": "(310) 777-7879",
      "website": "https://lasinusandsnoring.com/, https://drkayem.com/",
      "specializations": "Otolaryngology (ENT), Facial Plastic Surgery, Sleep Surgery, Sinus Surgery",
      "procedures_offered": "Radiofrequency treatments (soft palate, turbinates, tongue), SnorEx, Pillar Procedure, Deviated Septum Surgery, Endoscopic Sinus Surgery, Balloon Sinuplasty, Uvulopalatopharyngoplasty (UPPP), Hyoid Suspension",
      "inspire_certified": false,
      "notable_achievements": "Team Physician to the Los Angeles Kings (NHL), Board Certified by the American Board of Otolaryngology, Fellow of the Royal College of Surgeons of Canada.",
      "patient_reviews": "Dr. Kayem has positive reviews across multiple platforms (Zocdoc, Healthgrades, Yelp) with patients praising his knowledge, bedside manner, and treatment outcomes. His overall rating on Zocdoc is 4.91/5.",
      "insurance_accepted": "Accepts many insurance plans",
      "unique_services": "Offers office-based, non-invasive snoring and sleep apnea surgeries, including minimally invasive image-guided procedures.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-014",
      "name": "Doctor Steven Y. Park, MD",
      "slug": "doctor-steven-y-park-md",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Steven Y. Park, MD",
      "city": "New York",
      "state": "NY",
      "address": "No physical address, practice is now virtual coaching.",
      "phone": "No current phone number available for his coaching practice.",
      "website": "https://doctorstevenpark.com/",
      "specializations": "Sleep, Sleep Apnea, UARS, Snoring, CPAP, Dental, Surgery, Alternative",
      "procedures_offered": "Virtual coaching for sleep-related breathing problems. Formerly a surgeon, but no longer performs procedures.",
      "inspire_certified": false,
      "notable_achievements": "Author of the book 'Sleep, Interrupted'.",
      "patient_reviews": "Reviews on Yelp for his previous practice are generally positive, with patients praising his ability to diagnose and treat complex sleep and breathing issues.",
      "insurance_accepted": "Not applicable for coaching practice.",
      "unique_services": "Virtual coaching to help people overcome sleep-related breathing problems.",
      "practice_type": "Independent Clinic (Virtual Coaching)",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-015",
      "name": "Wardrop Med Services",
      "slug": "wardrop-med-services",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Pell Ann Wardrop, MD",
      "city": "Lexington",
      "state": "KY",
      "address": "160 N Eagle Creek Dr Ste 302, Lexington, KY 40509-2124",
      "phone": "(859) 967-5044",
      "website": "Not found",
      "specializations": "Sleep Medicine, Otolaryngology-Head & Neck Surgery",
      "procedures_offered": "Unknown",
      "inspire_certified": false,
      "notable_achievements": "Recipient of the American Academy of Otolaryngology—Head and Neck Surgery (AAO-HNS) Honors Award.",
      "patient_reviews": "Not available from search results.",
      "insurance_accepted": "Unknown",
      "unique_services": "Unknown",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-016",
      "name": "Northwestern Medical Faculty Foundation",
      "slug": "northwestern-medical-faculty-foundation",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Michael Awad, MD",
      "city": "Chicago",
      "state": "IL",
      "address": "675 North Saint Clair Street, Suite 200, Chicago, IL 60611",
      "phone": "(312) 695-8182",
      "website": "https://health.usnews.com/doctors/michael-awad-2391525",
      "specializations": "Otolaryngology (ENT), Sleep Medicine",
      "procedures_offered": "Unknown",
      "inspire_certified": false,
      "notable_achievements": "Patient Recommended Award",
      "patient_reviews": "4.6/5 stars on U.S. News Health. Patients praise his knowledge, attentiveness, and communication.",
      "insurance_accepted": "Cigna, Blue Cross, and others. It is recommended to contact the provider to confirm.",
      "unique_services": "Unknown",
      "practice_type": "Affiliated with Northwestern Medicine-Northwestern Memorial Hospital",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-017",
      "name": "Madison ENT & Facial Plastic Surgery",
      "slug": "madison-ent-&-facial-plastic-surgery",
      "type": "independent_practice",
      "lead_surgeon": "Stacey L. Silvers, M.D., FARS",
      "city": "New York",
      "state": "NY",
      "address": "161 Madison Ave FL 11, New York, NY 10016",
      "phone": "(212) 213-3339",
      "website": "https://madisonent-facialplasticsurgery.com/",
      "specializations": "Otolaryngology, Rhinology, Facial Plastic Surgery, Sleep Disorders",
      "procedures_offered": "Sleep apnea and snoring therapy, Balloon Sinuplasty, RhinAer, VivAer, nasal surgery",
      "inspire_certified": false,
      "notable_achievements": "Named among America’s Top Physicians and Surgeons (2003-2023), Castle Connelly Top Doctor (15 years), Fellow of the American Rhinologic Society (2019), featured on ABC and Dr. Oz show.",
      "patient_reviews": "Overall rating of 4.93/5 on Zocdoc based on over 1400 reviews. Patients describe her as professional, knowledgeable, and attentive.",
      "insurance_accepted": "Aetna, BlueCross BlueShield, Cigna, Emblem Health, Medicare, UnitedHealthcare, UnitedHealthcare Oxford",
      "unique_services": "Specializes in minimally invasive in-office procedures for sinus and breathing problems. Lead investigator for in-office Balloon Sinuplasty.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-018",
      "name": "ENT of Georgia South",
      "slug": "ent-of-georgia-south",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Howard Herman, M.D., Dr. Dozier Hood, M.D., Dr. Young H. An, M.D., Dr. Paul E. Free, M.D., Dr. Michael Sylvester, M.D. Note: Dr. Donald Sesso is not affiliated with this practice.",
      "city": "Atlanta",
      "state": "GA",
      "address": "1218 W Paces Ferry Rd NW, UNIT 208, Atlanta, GA 30327",
      "phone": "(770) 991-2800",
      "website": "https://entgasouth.com/",
      "specializations": "Otolaryngology (ENT), Sleep Disorders, Sleep Surgery",
      "procedures_offered": "Septoplasty, turbinate reduction, nasal valve surgery, Balloon Sinuplasty, Computer Image-Guided Sinus Surgery, Tonsillectomy, adenoidectomy, UPPP, Tongue base advancement, Radiofrequency palate/tongue reduction, Oral Appliance Therapy, Pillar Procedure, Soft Palate Coblation, Airvance Procedure",
      "inspire_certified": false,
      "notable_achievements": "Atlanta's longest-standing and most prominent medical practice focusing on the care of the Ears, Nose, and Throat, with over 100 years of combined experience.",
      "patient_reviews": "Patient reviews are generally positive, with patients praising the doctors' expertise and caring bedside manner. Dr. Herman and Dr. An are frequently mentioned for their excellent care.",
      "insurance_accepted": "Most major insurances. Patients should verify with the clinic.",
      "unique_services": "Offers modern office-based snoring procedures, including Somnoplasty.",
      "practice_type": "Specialty Group",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-019",
      "name": "The Snoring Center (Closed)",
      "slug": "the-snoring-center-(closed)",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Craig Schwimmer, MD (Deceased)",
      "city": "Dallas",
      "state": "TX",
      "address": "6901 Snider Plz, Ste 225, Park Cities Medical Plz, Dallas, TX 75205",
      "phone": "(214) 369-2345",
      "website": "http://www.snoringcenter.com (Defunct)",
      "specializations": "Otolaryngology, Sleep Surgery",
      "procedures_offered": "Unknown",
      "inspire_certified": false,
      "notable_achievements": "Founder of The Snoring Center, a pioneering practice for office-based snoring and sleep apnea treatment. Co-authored numerous articles on the relationship between obstructive sleep apnea and gastroesophageal reflux.",
      "patient_reviews": "Not available as the practice is closed.",
      "insurance_accepted": "Unknown",
      "unique_services": "Pioneered office-based treatments for snoring and sleep apnea.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-020",
      "name": "Chicago Nasal & Sinus Center",
      "slug": "chicago-nasal-&-sinus-center",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Jordan Pritikin, M.D.",
      "city": "Chicago",
      "state": "IL",
      "address": "111 West Washington Street, Suite 903, Chicago, IL 60602",
      "phone": "(312) 372-9355",
      "website": "https://chicagonasalsinuscenter.com/",
      "specializations": "Otolaryngology, Rhinology, Nasal and Sinus Disorders, Sleep Apnea, Allergies, Voice Therapy",
      "procedures_offered": "Septoplasty, Reduction of Nasal Fractures, Nasal Valve Repair, Endoscopic Sinus Surgery, Sleep Apnea Surgery, Laryngoscopy, In-Office CT Imaging, Allergy Testing & Desensitization Therapy, Interventional Rhinology",
      "inspire_certified": false,
      "notable_achievements": "Dr. Pritikin is a board-certified otolaryngologist and a Fellow of both The American Academy of Otolaryngology-Head and Neck Surgery and The American Rhinologic Society. He has participated in research exploring innovative therapies for nasal obstruction and chronic sinusitis. He was also named a 'Top Doctor' in 2023.",
      "patient_reviews": "Patient reviews are generally positive, with patients praising Dr. Pritikin's knowledge, caring manner, and professionalism. Some reviews mention that he takes the time to thoroughly diagnose the situation. Healthgrades and Yelp show positive reviews, while U.S. News has mixed but leaning positive reviews.",
      "insurance_accepted": "Website does not specify, but likely accepts most major insurance plans. Patients should call to confirm.",
      "unique_services": "The practice limits its scope to nasal and sinus disorders to offer a higher level of service. They offer in-office CT imaging and interventional rhinology.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-021",
      "name": "Houston Advanced Nose & Sinus",
      "slug": "houston-advanced-nose-&-sinus",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Arjuna Kuperan, MD",
      "city": "Houston",
      "state": "TX",
      "address": "9230 Katy Freeway #600, Houston, TX 77055",
      "phone": "(832) 720-6673",
      "website": "https://houstonadvancedsinus.com/",
      "specializations": "Rhinology, Otolaryngology (ENT), Sinus Surgery, Skull Base Surgery",
      "procedures_offered": "Balloon Sinuplasty, Endoscopic Sinus Surgery, Skull Base Surgery, Septoplasty, Nasal Polyp Removal, Cerebrospinal Fluid (CSF) Leak Repair, Epistaxis (Nose Bleed) Treatment, Sinus and Skull Base Tumor Resection, Orbital Tumor Resection, Pituitary Tumor Resection",
      "inspire_certified": false,
      "notable_achievements": "Dr. Kuperan is a fellowship-certified Rhinologist, a distinction held by a select few in Texas. He is an Ivy League graduate of Brown University and a certified diplomate of the University of Miami Miller School of Medicine Rhinology Fellowship. He has published academic research, book chapters, and scientific journal articles.",
      "patient_reviews": "Patients describe Dr. Kuperan as knowledgeable, thorough, and having an excellent bedside manner. They praise his ability to explain complex issues clearly and his dedication to finding effective treatment plans. Many reviews highlight successful outcomes after procedures, with patients experiencing significant improvements in their quality of life.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "Dr. Kuperan is a super-specialist in both simple and complex sinus, nasal, and skull base problems. The practice offers advanced diagnostic approaches to uncover the underlying causes of sinus issues.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-022",
      "name": "Great Neck Ear, Nose, & Throat",
      "slug": "great-neck-ear-nose-&-throat",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Josh Werber, M.D., F.A.C.S.",
      "city": "Great Neck",
      "state": "NY",
      "address": "833 Northern Boulevard, Suite 260, Great Neck, NY 11021",
      "phone": "(516) 829-3466",
      "website": "https://www.greatneckent.com/",
      "specializations": "Otolaryngology, Sleep Surgery, ENT",
      "procedures_offered": "Inspire, Balloon Sinuplasty, ClariFix Cryotherapy, Deviated Septum Surgery, Elevoplasty, Nasal Fracture Repair, Nasal Obstruction Surgery, Nasal Polypectomy, Parotid and Submandibular Gland Surgery, Pediatric ENT, Rhinoplasty, Septoplasty, Sinus Surgery, Sleep Study, Snoring & Sleep Apnea Treatment, Tonsillectomy, VivAer® Procedure",
      "inspire_certified": true,
      "notable_achievements": "Clinical Assistant Professor of Otolaryngology at New York University School of Medicine. One of a few physicians nationally accredited to perform the Inspire Procedure.",
      "patient_reviews": "Overall positive reviews, with patients highlighting his surgical skill and knowledge. Some reviews mention a rushed or unprofessional bedside manner. Zocdoc rating is 4.79/5.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "One of the few physicians nationally accredited to perform the Inspire Procedure for obstructive sleep apnea.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-023",
      "name": "Henry Ford Medical Center",
      "slug": "henry-ford-medical-center",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Kathleen L. Yaremchuk, MD, MSA",
      "city": "Detroit",
      "state": "MI",
      "address": "2799 W Grand Blvd, Detroit, MI 48202-2608",
      "phone": "(313) 916-3275",
      "website": "https://www.henryford.com/physician-directory/y/yaremchuk-kathleen",
      "specializations": "Otolaryngology, Sleep Medicine",
      "procedures_offered": "Inspire, Sleep Apnea Surgery, UPPP",
      "inspire_certified": true,
      "notable_achievements": "Chair of the Department of Otolaryngology at Henry Ford Hospital; Clinical Professor at Michigan State University and Wayne State University; numerous publications and involvement in clinical trials.",
      "patient_reviews": "Patients generally report positive experiences, highlighting her knowledge and helpfulness. Vitals.com shows an average rating of 4.5 stars based on 17 ratings.",
      "insurance_accepted": "Most major insurances accepted as part of the Henry Ford Health System. Specific plans should be verified with the provider.",
      "unique_services": "Comprehensive sleep medicine practice within a large, integrated health system, offering a wide range of diagnostic and treatment options.",
      "practice_type": "Hospital-affiliated practice (Henry Ford Health System)",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-024",
      "name": "Houston Methodist ENT Specialists",
      "slug": "houston-methodist-ent-specialists",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Masayoshi Takashima, MD, FACS",
      "city": "Houston",
      "state": "TX",
      "address": "6550 Fannin Street, Floor 17, Houston, TX 77030",
      "phone": "(713) 441-1368",
      "website": "https://www.houstonmethodist.org/doctor/masayoshi-takashima/",
      "specializations": "Otolaryngology (ENT), Rhinology, Sinus, and Skull Base Surgery, Sleep Surgery",
      "procedures_offered": "Allergic rhinitis, Endoscopic sinus surgery, Pituitary surgery, Pituitary tumor, Robotic surgery, Sinusitis, Skull base surgery, Sleep apnea, Sleep surgery, Tumors",
      "inspire_certified": false,
      "notable_achievements": "Chair, Department of Otolaryngology, Houston Methodist; Sylvia and James E. Norton Distinguished New Century Chair, Department of Otolaryngology; Professor of Otolaryngology, Academic Institute; Listed in 'Best Doctors in America'.",
      "patient_reviews": "4.9/5 stars based on 497 ratings. Patients consistently praise his attentiveness, clear explanations, and successful surgical outcomes.",
      "insurance_accepted": "Most major insurances",
      "unique_services": "Dr. Takashima is dedicated to incorporating the most recent medical advancements into patient care and has helped pioneer several new surgical techniques.",
      "practice_type": "Hospital-affiliated center",
      "featured": false,
      "verified": true
    },
    {
      "id": "clinic-025",
      "name": "Robert Kotler, MD, FACS (also known as Beverly Hills Sinus Institute)",
      "slug": "robert-kotler-md-facs-(also-known-as-beverly-hills-sinus-institute)",
      "type": "independent_practice",
      "lead_surgeon": "Dr. Robert Kotler, MD, FACS",
      "city": "Los Angeles",
      "state": "CA",
      "address": "436 N. Bedford Dr., Ste. 201-D, Beverly Hills, CA 90210",
      "phone": "(310) 893-6910",
      "website": "https://www.losangelesrevisionrhinoplasty.com/",
      "specializations": "Cosmetic, Plastic & Reconstructive Surgery, Ear, Nose, and Throat (ENT), Otolaryngology-Head and Neck Surgery, Rhinoplasty",
      "procedures_offered": "Sleep Apnea, Evaluation and Treatment of Sleep Disorders, Home Sleep Study, Complex Revision Rhinoplasty, Non-Surgical Rhinoplasty, Septoplasty, Nasal Surgery, Sinus Surgery, Facelift, Neck Lift",
      "inspire_certified": false,
      "notable_achievements": "Over 55 years of experience, performed over 10,000 major cosmetic procedures, and was a featured surgeon on the TV show Dr. 90210.",
      "patient_reviews": "4.6-star rating on Healthgrades based on 9 reviews. Patients praise his craftsmanship, experience, and natural-looking results, especially in complex revision rhinoplasty cases.",
      "insurance_accepted": "Most major insurances. Please call to verify.",
      "unique_services": "Pioneered a non-surgical revision rhinoplasty technique using permanent medical-grade liquid silicone injections.",
      "practice_type": "Private Practice",
      "featured": false,
      "verified": true
    }
  ]
}