{
  "studies": [
    {
      "id": "study-001",
      "name": "STAR Trial: Stimulation Therapy for Apnea Reduction",
      "type": "Cohort Study",
      "sample_size": "126",
      "follow_up": "5 years",
      "ahi_reduction": "",
      "success_rate": "75%",
      "cure_rate": "44%",
      "key_findings": "Upper-airway stimulation led to significant and sustained improvements in objective and subjective measurements of the severity of obstructive sleep apnea over 5 years. Adverse events were uncommon, and the therapy was found to be a successful and appropriate long-term treatment for individuals with moderate to severe OSA.",
      "source": ""
    },
    {
      "id": "study-002",
      "name": "Results of the ADHERE upper airway stimulation registry and predictors of therapy efficacy",
      "type": "Cohort Study",
      "sample_size": "1017",
      "follow_up": "12 months",
      "ahi_reduction": "",
      "success_rate": "Not explicitly stated in abstract",
      "cure_rate": "Not explicitly stated in abstract",
      "key_findings": "Across a multi-institutional study, UAS therapy continues to show significant improvement in subjective and objective OSA outcomes. This analysis shows that the therapy effect is durable and adherence is high. In a multivariate model, only female sex and lower baseline body mass index remained as significant predictors of therapy response.",
      "source": ""
    },
    {
      "id": "study-003",
      "name": "Maxillomandibular Advancement and Upper Airway Stimulation for Treatment of Obstructive Sleep Apnea: A Systematic Review",
      "type": "Systematic Review",
      "sample_size": "1610",
      "follow_up": "MMA: 25.9 months; UAS: 18.8 months",
      "ahi_reduction": "",
      "success_rate": "MMA: 41.1-100%; UAS: 26.5-77.8%",
      "cure_rate": "MMA: 36-67.9%; UAS: 6.7-44%",
      "key_findings": "Both MMA and UAS are effective and generally safe therapies for OSA. However, due to the limitations of the included studies, there is no evidence yet to directly compare these two procedures in OSA treatment.",
      "source": ""
    },
    {
      "id": "study-004",
      "name": "Reviewing the Systematic Reviews in OSA Surgery",
      "type": "Systematic Review",
      "sample_size": "378",
      "follow_up": "Not specified",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "Not specified",
      "key_findings": "Although obstructive sleep apnea surgery is associated with improved outcomes in most studies, the level and quality of evidence reviews requires improvement. Outcomes for sleepiness and snoring demonstrated significant improvement across included reviews.",
      "source": ""
    },
    {
      "id": "study-005",
      "name": "Objective and subjective long term outcome of maxillomandibular advancement in obstructive sleep apnea",
      "type": "Cohort Study",
      "sample_size": "82",
      "follow_up": "2 years",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "Not specified",
      "key_findings": "MMA is a clinically effective treatment for patients with moderate-to-severe OSA as demonstrated by significant long-term decrease in AHI and improvement in neurocognitive testing.",
      "source": ""
    },
    {
      "id": "study-006",
      "name": "Effectiveness of Palatopharyngeal Surgery Modifications in Obstructive Sleep Apnea: A Meta-analysis",
      "type": "Meta-Analysis",
      "sample_size": "1501",
      "follow_up": "10 months",
      "ahi_reduction": "",
      "success_rate": "51%",
      "cure_rate": "Not reported",
      "key_findings": "Palatopharyngeal surgery without tonsillectomy is effective, but results differ significantly regarding surgical techniques. Powered instruments, sutures, and muscle relocation techniques have been reported to yield more favorable results compared to cold steel, radiofrequency, laser, and palatal implants.",
      "source": ""
    },
    {
      "id": "study-007",
      "name": "Upper Airway Stimulation for Obstructive Sleep Apnea: 5-Year Outcomes",
      "type": "Cohort Study",
      "sample_size": "126",
      "follow_up": "5 years",
      "ahi_reduction": "",
      "success_rate": "75%",
      "cure_rate": "41%",
      "key_findings": "Improvements in sleepiness, quality of life, and respiratory outcomes are observed with 5 years of UAS. Serious adverse events are uncommon. UAS is a nonanatomic surgical treatment with long-term benefit for individuals with moderate to severe OSA who have failed nasal continuous positive airway pressure.",
      "source": ""
    },
    {
      "id": "study-008",
      "name": "Systematic review and updated meta-analysis of multi-level surgery for patients with OSA",
      "type": "Meta-Analysis, Systematic Review",
      "sample_size": "3931",
      "follow_up": "Not specified in abstract",
      "ahi_reduction": "",
      "success_rate": "60.2%",
      "cure_rate": "Not specified in abstract",
      "key_findings": "Multilevel surgery for OSA patients is associated with significant improvement of treatment outcomes.",
      "source": ""
    },
    {
      "id": "study-009",
      "name": "The Effectiveness of Tonsillectomy and Adenoidectomy in the Treatment of Pediatric Obstructive Sleep Apnea/Hypopnea Syndrome: A Meta-Analysis",
      "type": "Meta-Analysis",
      "sample_size": "392",
      "follow_up": "Not specified",
      "ahi_reduction": "",
      "success_rate": "82.9%",
      "cure_rate": "Not specified",
      "key_findings": "T/A is effective in the treatment of OSAHS. However, success rates are far below 100%, which could have far-reaching pediatric public health consequences.",
      "source": ""
    },
    {
      "id": "study-010",
      "name": "Transoral robotic base of tongue reduction for obstructive sleep apnea: a systematic review and meta-analysis",
      "type": "Systematic Review, Meta-Analysis",
      "sample_size": "353",
      "follow_up": "Not specified",
      "ahi_reduction": "",
      "success_rate": "68.4%",
      "cure_rate": "23.8%",
      "key_findings": "TORS BOT reduction decreases AHI and symptoms of sleepiness in adult patients with OSA. It is considered successful in a majority of cases; however, further studies must be performed to optimize patient selection criteria to achieve higher rates of success.",
      "source": ""
    },
    {
      "id": "study-011",
      "name": "Is drug-induced sleep endoscopy associated with better outcomes after soft tissue surgery for sleep apnea? A systematic review and meta-analysis",
      "type": "Systematic Review and Meta-Analysis",
      "sample_size": "791",
      "follow_up": "Not specified",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "Not specified",
      "key_findings": "DISE was not associated with a higher success rate or significant changes in AHI, minimal SpO2, or ESS compared to no DISE. The authors conclude that soft tissue surgery does not yield better results after DISE, but the evidence level is low.",
      "source": ""
    },
    {
      "id": "study-012",
      "name": "Surgical versus Non-Surgical Management of Obstructive Sleep-disordered Breathing in Children: A Meta-analysis",
      "type": "Meta-Analysis",
      "sample_size": "459",
      "follow_up": "Not specified",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "Not specified",
      "key_findings": "Surgical intervention (adenotonsillectomy) provides a significant clinical improvement in disease-specific quality of life and reduces healthcare utilization for children with obstructive sleep-disordered breathing compared to non-surgical management.",
      "source": ""
    },
    {
      "id": "study-013",
      "name": "Hypoglossal nerve stimulation versus positive airway pressure therapy for obstructive sleep apnea",
      "type": "Comparative Study",
      "sample_size": "126",
      "follow_up": "12 months",
      "ahi_reduction": "",
      "success_rate": "HNS: 84% (AHI < 15), PAP: 87% (AHI < 15)",
      "cure_rate": "HNS: 51%, PAP: 59%",
      "key_findings": "Patients treated with HNS therapy had significantly greater improvements in daytime sleepiness compared to PAP therapy, while the mean reduction of AHI and overall effectiveness were comparable for both treatments.",
      "source": ""
    },
    {
      "id": "study-014",
      "name": "Bariatric surgery and obstructive sleep apnea: a systematic review and meta-analysis",
      "type": "Systematic Review, Meta-Analysis",
      "sample_size": "2310",
      "follow_up": "12.7 months",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "65%",
      "key_findings": "Bariatric surgeries are effective in reducing obesity among patients with OSA in addition to OSA severity measures. However, the low rate of OSA remission suggests that the main etiology of OSA is not only obesity but also includes other important variables such as the anatomy of the jaw.",
      "source": ""
    },
    {
      "id": "study-015",
      "name": "The Role of Isolated Nasal Surgery in Obstructive Sleep Apnea Therapy-A Systematic Review",
      "type": "Systematic Review and Meta-Analysis",
      "sample_size": "1077",
      "follow_up": "12 months",
      "ahi_reduction": "",
      "success_rate": "Not specified",
      "cure_rate": "Not specified",
      "key_findings": "Isolated nasal surgery did not significantly improve the AHI in the majority of the studies. The meta-analysis suggests a slight decrease in AHI after nasal surgery, but this reduction is not clinically relevant in terms of treatment success. Isolated nasal surgery can possibly improve OSA subjectively (ESS). Isolated nasal surgery should therefore not be recommended as a first-line treatment for OSA.",
      "source": ""
    }
  ]
}